["RT @calebsaysthings: people say “I wouldn’t wish it on my worst enemy” about the lamest things I’ve ever heard. if you wouldn’t wish one da…","Authority figures talking about how face touching is so dangerous and unclean. Like, are you TRYING to make it my new fetish?","When you only have a few Quibis left on Earth https://t.co/JzeZYD7nZV","@titobeauvi21 These replies have been my entertainment for the last two days. Thank you all for regaling me with th… https://t.co/ko03hcF4i0","I actually keep my table set like this through the entire holiday season. Eat your own chips then check out the ful… https://t.co/wQuixvFfrN","How I feel about driving and also everything else https://t.co/0aTVtYf1AR","@LouisPeitzman I’m too post-dinner drunk for this to show up in my timeline Growing HeartLoudly Crying Face https://t.co/wCImvvfsma","I sing, I dance, I eat chips. See all the fun I had with @Fritolay #sponsored https://t.co/4EX3BDw2bk","There must be SO much elevator security cam footage of me with headphones on, where I get in, wait for the doors to… https://t.co/cXprA3QZx9","RT @Trolls: Can Rock Trolls stop the feeling?! Face Screaming in FearFace Screaming in FearFace Screaming in Fear Watch the new trailer for #TrollsWorldTour, in theaters everywhere April 17! https://t.c…","@edgarwright Admitting you have a problem is the first step Orange Heart","RT @ArcLightCinemas: \"Sometimes it's harder to catch a real terrorist than it is to manufacture your own.\" Reserve your seats for Chris Mor…","Loved my experience with @katespadeny. Such a beautiful show. #loveinspades #nyfw #katespade #sponsored https://t.co/WJp8uAeYhm","Ghosting: because I’d rather look like an asshole than let you slowly find out that I suck.","Together againRed Heart️ Come along for the ride through New York Fashion Week. Follow along this week and tune in live on… https://t.co/V8nrlN9VVX","@edgarwright @lastnightinsoho It’s RRRRREAL!!!! Congratulations!!!!!! Yellow HeartYellow HeartYellow HeartYellow HeartYellow HeartYellow HeartYellow HeartYellow HeartYellow Heart","When girls walk through a grocery store produce section in a summertime outfit https://t.co/pEsYFMGrFD","My favorite thing about the #Cats trailer is that it didn’t awaken anything (new) in me, sexually. So. Phew.","UPDATE 2: Guys, guys. It turns out, the other person isn’t trying to hit the ball toward you, they are actively try… https://t.co/DfVhBq0u78","UPDATE: There is not a tennis court in the room I’m currently in so I would have to like, what, walk to one? Or wal… https://t.co/YiuP3wpbyL","Guys. I checked out #Wimbeldon2019 and (I’m sure I’m the first to notice) it looks like tennis is fucking DIFFICULT… https://t.co/3OJzi6X4Vx","@edgarwright Hahahaha I KNEW you were gonna tweet this!","@louisvirtel https://t.co/ojgkXS9idF","LET’S GO SAVE THE WORLDCollision #TrollsWorldTour https://t.co/ZcodV7f2IH","Check out Poppy’s new #TrollsWorldTour poster. And the trailer drops tomorrow. Hey @jtimberlake, does this mean it’… https://t.co/4YJ11CMrqP","I'm so unreliable. I'm the airline of people.","https://t.co/APtnWAtEdb https://t.co/LbeEh70cCn","@abigail_hevron8 is from yesterday","@ABunchofComics Huh. Dammit.","Well. I was literally about to eat a raspberry, it was centimeters from my mouth, and noticed a very small SPIDER o… https://t.co/Jp3dgJzBYG","I got a new P touch label maker and I talk about it like it’s a sketchy new religion that’s changing my life. If it… https://t.co/NiFOwIb8Nd","Double Exclamation Mark️ Down Arrow️Down Arrow️Down Arrow️Double Exclamation Mark️ https://t.co/leSoGjjEQT","@BarstoolBigCat Getting @ZacEfron involved was a MOVE.... I like getting you boys pressed.\n\n................\n\n.....… https://t.co/LQgg5b9MFK","RT @AlannaBennett: Every person with a uterus https://t.co/rlQ8Ft0HGC","No spoiler. Conleth Hill and @Maisie_Williams are so talented it’s gross. (And everyone else. Obviously.) But right… https://t.co/lEjtSe68FG","@desusnice https://t.co/9avP71dimL","Theory: the country has gone to shit because we stopped selling Viennetta. https://t.co/KfUCdbppRW","Omg. Black Heart https://t.co/7CnP1HfJ6L","As a selling point, I don't understand the saying \"It's like &lt;thing you love&gt; on steroids!\" \n\nSome things are bette… https://t.co/UrwMsBZJ6K","Fun day with @whatthefit https://t.co/z4Wq0dqCdz","Sweatpants without pockets, you can fuck all the way off.","Can they do a “Chopped Basic” for cooking illiterate folks like me? Give contestants tomatoes and olive oil and reg… https://t.co/dZZbtCc1rQ","That’s stupid. \n\n“siri make an appointment at a dog groomer” https://t.co/85VBPsazRW","@brandicarlile Dude. You don’t even know. My jaw is still on the floor of the Staples Center. I bow to you.","So. \n\nI am changed. \n\nMy jaw is on the floor. Holy shit. \n\n#BrandiCarlile #GRAMMYs","That was extraordinary. I feel so grateful to have had a front row seat to witness a woman on her 75th birthday be… https://t.co/4S5tJY2z2O","I told BTS that their fans are very passionate and when they saw I’d be sitting with them, they told me to look out… https://t.co/73dW36TKD5","I was worried that my pain would turn out to be “nothing serious” or something that I should have been able to figh… https://t.co/NU45NSb2MO","…the young woman whose name started with “L”?? I can’t remember… in fairness, you were one of the people giving me… https://t.co/IWXCnkIjBP","So, I need to give a shout out to the Atlanta doctors and nurses who helped me through my first experience with kid… https://t.co/XmMiBlxo4N","RT @NoBayouBridge: Students from Covington Catholic High School in Kentucky wearing #MAGA hats mocked an elder at the #IndigenousPeoplesMar…","RT @laurenlapkus: i refuse to click and will take this at face value https://t.co/9Zlr5TQ3LI","I love Maine. I love Mainers. Blue HeartBlue HeartBlue HeartBlue HeartBlue HeartBlue HeartBlue HeartBlue Heart","Holy shit. I just remembered I was in Twilight.","RT @MichelleObama: Have you voted? There’s still time to get to the polls. Don't sit this one out and hand over important decisions that af…","I am a voter. Are you? Text VOTER to 26797 and make a plan to vote on Tuesday, November 6. @iamavoter","@KayKayCannon @rchsricketts We are discussing this IN DETAIL tomorrow dude.","Red Heart️Red Heart️Red Heart️Red Heart️ DANNY!!!!!! https://t.co/ibYcj1uwlQ","Tell me your secret #InTheaters https://t.co/pm8hTSr76S","I’m on @colbertlateshow tonight! I tell the story of the time I accidentally insulted a .......*very* famous person… https://t.co/kIAqjXyDD9","This was the most fun I’ve had on a talk show. And for the record: we’re kidding around at the beginning - this was… https://t.co/C1gnBd17Th","Eyes https://t.co/tu7vkmOpbs","I got cold so I finally said fuck it and put on a hoodie. It wasn’t until the commercial break, but we still had fu… https://t.co/Pv82k9VyaV","@MysteryGuitarM @LateNightSeth @ASimpleFavor You joke, but these t-shirts are THE softest. I take them every single… https://t.co/IPdNpsxcjh","Post-appearance-swag, long-ass-day, gettin-ready-for-bed outfit @LateNightSeth #Tonight https://t.co/xEUDhfStPz","Obsessed. We should have had you on the marketing team. https://t.co/QKV3KOwMVv","Answering the internet’s most asked questions!*\n\n*about Anna Kendrick and Blake Lively \n\nhttps://t.co/Jm8Rzxk8aH","Oops Fire https://t.co/vgjoY38KTF","It’s not what you think...... Kiss Mark https://t.co/ccTp62Yk9u","Coming at you @GMA !!!! I’m under-slept and ready for action!!! Collision","I’m coming on the show this week, and I think I might get fully pregnant if I’m in the same room as that beard. \n\nS… https://t.co/97t38Z3Mds","@JAdomian @jack James I truly fear the day that I incur your wrath.","@kelleyjakle @chrissiefit I’ll always come to your birthdays, I’ll always hide on mine!! I love you so much tho!!!!… https://t.co/BcVd7dKvRi","At CVS, got asked if I’m the girl from House of Cards. Always know my skin in looking right when I get @katemara Tongue https://t.co/WuCDCP1zMj","@IsaacWebster @RyBrockington Red Heart️Red Heart️Red Heart️","RT @aparnapkin: One day I will be able to express my anger but until then I guess a lot of loaded breathing","@Aesthetic_Mag @BootsandHearts Ok, ok, that’s not me but for a second I thought it was cause that chick does look l… https://t.co/ndEzfQ8HKS","@meeracleshappen https://t.co/S4gGHGZLUE","@meeracleshappen @mindykaling Q: (re, your username) Am I not ice skating with you because you *are* me and we can’… https://t.co/4wbQ3vlLVv","“I'm so cold. Now I'm immediately so hot.”\n\n- my internal journey every four seconds on a plane.","@JanelleMonae @RubyRose Rubaeeeeeeeeeeeee!!!Dizzy FaceDizzy FaceDizzy FaceDizzy FaceDizzy FaceDizzy FaceDizzy FaceDizzy Face","@Allison_Tolman Honestly? That’s my bad. Natural light is key. Even “dream Anna” should know that.","@aparnapkin Congrats AparnaTwo HeartsTwo HeartsTwo Hearts","@KayKayCannon So you’re telling me this ISN’T Beca monologuing in a coked-out stupor in PP7? Disa-aca-pointed.","When your friends have a traditional wedding but you’re fashion as hell and not gonna hide it. \n\nLove all of this s… https://t.co/x7FEvuJF5u","I could be completely projecting but I relate to that moment The Vixen walked out. When ur either gonna cry or scre… https://t.co/Nawm2Ivjs3","Corey Lewandowski, you are a piece of shit. https://t.co/0XeGkev2bW","@zoeinthecities Red Heart️Red Heart️I have had more than 1 director surround me w background actors all 6 feet+ w/o telling me and… https://t.co/PN3xNRaw2w","When you are awake at 4:30 in the morning for no GD reason and you check Twitter to find that (on the day you need… https://t.co/TdJtn9PlNf","RT @VancityReynolds: You can tell me. We’re married. You once drove me to the hospital when you were giving birth. So... what the fuck happ…","RT @paulfeig: So excited to present the second teaser trailer for @ASimpleFavor. I couldn’t be more excited about this film. @AnnaKendrick4…","@RyBrockington Well it was a move of that era. A very *naming your third album just BRITNEY* move.","@RyBrockington Whoaaaaaa. I used to watch that show with my mom basically every week and I remember *very* little a… https://t.co/qBL6G3lp13","@SweetWitchCoven I actually favor a couple of the various gonewild subs but uh, fucking hell this all kicked off. G… https://t.co/UFshKmUuq9","My online shopping style: \n\nPut everything I like in the cart. \n\nEdit. \n\nEdit more. \n\nEdit until I’m down to one it… https://t.co/Xg1Lbd0aFu","@lindazge It’s @ARITZIA  I got this dress a while ago but I love all their stuff, esp for those of us who are not blessed to be 5’10. Straight Ruler Folded Hands","Yo @VancityReynolds my plan to steal your wife is already going so well that she’s getting the two of us confused.… https://t.co/ujh3NYA8OL","I didn’t text you back because I couldn’t find the right gif.","RT @paulfeig: Here’s the first look at my new movie @ASimpleFavor starring the amazing @AnnaKendrick47 and @blakelively. I am so excited ab…","\"I don't know, sometimes I just wish there was a room you could sit in that made breathing harder.\"\n\n- inventor of the sauna","@violetville Tina, you can just be honest and say you miss me girl. “Hacked”. Sure.","@miz_cracker Are we The Chainsmokers now?","Ah, the old \"seasick\" style earthquake. I'm gonna be dizzy the rest of the day. Nauseated Face","RT @AnnaKDoing: if you                           then you don't \ndon't love                    deserve \nme at my                     me at…","@Adaripp @mattie_rogers Literally how I've crafted my down-to-earth persona for the last 8 years. Brb, gotta go be… https://t.co/5Ov1GZrXaY","@Adaripp @mattie_rogers I do not relate to this in a personal and specific way. At all.","RT @ABC: Emma Gonzalez stayed on stage at the D.C. #MarchForOurLives rally for 6 minutes and 20 seconds - the duration of the Parkland shoo…","This was SO HILARIOUS! (If you are ill, watch at your own risk. It sent me into several coughing fits.) Go… https://t.co/4oaNXqEYDe","I think my favorite thing about finishing a big job is getting really really sick as soon as it's over. (And feelin… https://t.co/J7V8ifAnd0","@katemara @rilaws Dude same.","@ellabellasmith Miss you both Face Blowing a KissFace Blowing a Kiss","@RubyRose Maybe the next generation Ruby. Our daughters will have cartoon vaginas, and we with think, \"Yes, this is… https://t.co/QxxFiOYFA5","@RubyRose DUDE ME TOO. I was like, wow, they really couldn't give a shit about making sure people are \"comfortable\"… https://t.co/JzoUQKaG8B","From now on, I'm only going to measure time in how many #LawAndOrder SVUs I can watch on @hulu. I decided this 7 SV… https://t.co/e2L5MtPLsq","@pejvahdat LIVE TWEET IT","@BenSPLATT I thought the best thing I could do as a friend was make mental notes on Beyoncé's reaction to your perf… https://t.co/vvtsFLNHPf","Punish me with those vocals @BenSPLATT Dizzy Face #GRAMMYs","One of consolation puppies just got walked past me so the night is pretty much downhill from here. #GRAMMYs","@lolsam Yes. cc: @RyBrockington","@ErinPrivratsky  https://t.co/ekqsnF9SGb","@sparksflyliz SHUT UP LIZ NOBODY ASKED YOU OMG","@SmithSsmith03 I would love that! So romantic. So lush. (I only read half that book; I hope nothing bad happens.)","@sherryrose Pilates. Clean eating. Rest. Botox.","I realize the confusion probably came from the two Anna K names, but she's a tall blonde athlete and I'm - oh,  oh… https://t.co/EZZkkRGOkB","Dear Yahoo: how do I get to this timeline where I've slept with Enrique Iqlesias please and thank you. https://t.co/4mmA2i7dse","RT @AnnaKendrick47: Sometimes I feel like I could pull off the perfect murder. I'm not saying I would… but I think I could. \n\nMerry Christm…","It is not my birthday. I will still accept cake. https://t.co/CwmFOoAGwJ","EEEEEEEEEEEEEE!!!!!! Smiling Face with Heart-EyesFace Screaming in FearSmiling Face with Heart-EyesFace Screaming in FearSmiling Face with Heart-EyesFace Screaming in FearSmiling Face with Heart-EyesFace Screaming in FearSmiling Face with Heart-EyesFace Screaming in Fear https://t.co/GCUOUXU6pX","\"Remember when we all pretended to like mushroom shavings that tasted like feet just bc they were expensive?\"\n\n-eve… https://t.co/y7jEejysGd","Who knew you could feel so competitive and look so silly at the same time. https://t.co/rfadKul7k6","@RubyRose What? Was not! What? I was - shut up! Flushed FaceUpside-Down Face","I like this. A lot. https://t.co/J64C4wLMCB","@ultwatson If @hanamaelee protects me through the zombie apocalypse? ...  maybe.","Honestly, this is my best case scenario for real life. https://t.co/ALBDgX7gGf","I was born in this hospital. I'm sending a card your way Jacob you handsome devil. https://t.co/yt9EC9WjAL","@YeahHeDid @animadverto @trappcandles Ooooh, amazon has been saying it won't ship to Vancouver, but if I go to amaz… https://t.co/HZ7MGQMco2","@animadverto @trappcandles Mississauga in Ontario? That might be a touch too far....","Vancouver folks: is there somewhere I can buy Trapp Candles in the area?? If it's gonna be raining like this I need… https://t.co/ZMsepHd3M5","@BenSPLATT Uuuuuuuuuughhhhh my whole life tho. Fuck. That. Shit. Kiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss MarkKiss Mark https://t.co/got1n4AV4n","@PoorCorgiActor @NeoDorito Come back Bentley Tired FaceTired FaceTired Face","@AliDSpenceHxx Production stress. I'M FINE!!","@AliDSpenceHxx It's the long suffering older brothers dressed as branch that kill me Weary FaceBroken Heart","@uncannyale I would have skipped it! Priorities!","There was a \"Corgi Halloween Parade\" in Vancouver today and NONE of you told me??? I'm calling the cops.","Loudly Crying FaceTired FaceLoudly Crying FaceTired FaceLoudly Crying FaceTired FaceSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling HeartSparkling Heart My heart is bursting from cute https://t.co/7BgdT917IV","@KayKayCannon I'm so jealous rn. Completely in love with her. I want to be like her when I grow up.","@ChrisEvans Dude. This is so real.","I mean. This hurts my feelings. But. https://t.co/LaluZZrC4f","Fuck. Fuck. I don't think I realized how much I love this woman, who I don't know. Love her more for speaking up fo… https://t.co/J8xy50z7aE","RT @cmclymer: I'm one of countless military veterans taking a knee. Do not exploit our service to silence black Americans and endorse racis…","Everything in this tweet makes me so happy. https://t.co/Uou37pDt7x","@Emilee_Ayers OMFG I'm SCREAMING. Rolling on the Floor LaughingRolling on the Floor LaughingRolling on the Floor LaughingRolling on the Floor Laughing I'm so sorry for what you've been through, I bow to you, queen of gallows hu… https://t.co/FpHSo7bici","@ECBuckingham So was Voldemort.","The Samantha American Girl Doll seems like a bitch. Don't @ me.","@BenSPLATT Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️Grinning Face with Big EyesRed Heart️","@mshowalter Like cranberry, lovely as a flavoring, hideous to eat raw. I fear not the blackberry lovers, for I have right on my side.","@zoeinthecities This speaks to me more than you could know. Also I don't pack socks anymore. I buy a cheap pack when I land.","RT @jules_su: I cannot handle this right now. https://t.co/JXjuHH2ivA","I'm gonna miss the eclipse and I'm really worried no one is gonna post a crappy picture of it on instagram.","Just wheeling a few extra paperbacks into Union Square #ScrappyLittleNobody #fashionpajamas https://t.co/JKyNCtG8Oy","@KarenAttiah @EbolaPhone @bragging Hahaha! I bow to you! What a fucking excellent piece!","RT @KarenAttiah: My latest: Here's how the Western MediaTrade Mark would cover #Charlottesville if it happened in a foreign country. https://t.co/p7…","RT @vicenews: VICE News had exclusive access from the front-lines of Charlottesville, and you can watch the full episode now https://t.co/g…","RT @_hudahassan: help 20-year-old Deandre Harris, who was beaten by white supremacists in Charlottesville, with medical costs: https://t.co…","@BenSPLATT Young wine on an airplane","Direct sunlight: that helpful friend who points out all the spots you missed shaving","Twitter: \"Oh noooo, Arya and Dany are getting all bloodthirsty and going bad!\" \n\nMe: https://t.co/rWAvoACzhH","I've still never seen a fidget spinner in person. So I guess I've made all the correct life choices?","@dashboardmusic All of them. All. Of. Them.","when I see someone going about their life without crippling self-doubt https://t.co/rqgYl6tOkW","@MattNewtonLewis Your wife sounds awesome.","@louisvirtel We're so lucky to be alive right now.","@emmafreud @SharonHorgan You beast. I swear if you hadn't just made me blueberry pie... Kiss Mark","Don't have enough sarcastic rambling in your life? #ScrappyLittleNobody is out in paperback in the UK today… https://t.co/bj1vOlEW5n","When I put in a new tampon and five minutes later think, \"but did I take out my old tampon?\" https://t.co/8gMeZspIvn","This looks like you guys are praying I make that free throw.... \n\n(I probably won't.) https://t.co/ZDqtwXDP2z","Why is every TV detective also a fashion expert? \n\n\"Our witness is a plumber but he's wearing Gucci shoes – must ha… https://t.co/QnTNF7GBHN","Absolutely gut wrenching. God bless the people of Manchester offering rooms and rides tonight. #roomformanchester","Those friends that wait for you to dive into the selfie at the last second 🇲🇽 https://t.co/PYgdTYtYYG","Any aspiring drag queens looking for a name, please consider: \"Solange Farewell\" \n\n(courtesy of @RyBrockington)\n\nThis concludes our PSA.","@brittacyr Yes!!!! It was!!!!!!!!","@ashley_andsasha I mean, it was when I was like 9, I just couldn't fit that.","@megan_haskins22 Your tone is very pointed. But also, right?? Everyone did, I don't just think that right?","@claudsxpenn Cause I've been drinking.","I got my ears pierced at Claire's, probably by a girl who was like 16 and that shit is still a part of my body. Claire's manGem StonePerson Shrugging🏻‍♀️","Every time \"Kendrick\" is trending I get worried I'm in a Ghost situation and this is how I find out I'm dead.","( ..... I'm doing a really good \"listening face\"  ......  I wonder what they're saying ..... )\n\n- me all the time","United: We just did the worst thing.\n\nMe: Hold my beer…I just need to put my wallet away. Ok. Thanks so much.\n\n(Am I doing Twitter right?)","Is a museum just an endurance test of how long you can last before you start making silly comments about the art?","All that ornate furnishing would get me stressed. - me, deciding I probably couldn't be the president.Face with Rolling Eyes","Crossover shade. https://t.co/9QVtbOvX5I","Lot of people seem really proud of themselves for announcing they \"already knew\" Barry Manilow was gay. Yeah……ur the true heroes today guys.","Ah, April Fools. A day of knowing that if you are actually injured, no one will help you. #SafetyFirst #Worrier","@RubyRose @PitchPerfect I had this arranged. I am very powerful and have NO respect for privacy. Kiss MarkEyes","@racheld Oops. See-No-Evil MonkeyNeutral Face","@RubyRose I live for your microphone lip drag MicrophoneMouthMicrophoneMouthMicrophoneMouth #swoon Missing you kids already xx","Hey.\n\nPeople who follow over 1,000 people on twitter. \n\nExplain yourselves.","@chrissiefit I don't know what I was doing during this pic but I'm not gonna rule out that I got caught up coloring. Cause I'm five.","Names are weird. \n\nAm I high?","@Snowsglowsticks I hate this. I hate you. ..................………………………………………………………………………………………..............……………………………………im suh beautiful"]