["RT @thevoiceuk: It's Saturday which means it's #TheVoiceUK Day which means it's Get Emotional At The Telly Day! Television\n See you at 8.30pm on @IT…","Thank god you edited this @thevoiceuk Hear-No-Evil MonkeyFace with Tears of Joy https://t.co/cTxfnQvymO","RT @thevoiceuk: It's Saturdayyyyy! Which means your fave OTT red chairs are back Face Blowing a Kiss \n#TheVoiceUK Battles continue tonight at 8.30pm on @ITV…","Smiling Face with SunglassesBeach with UmbrellaThrowback to delicious Mauritius, casual jeep posesVictory HandSquinting Face with Tongueand quite possibly my favourite @nextofficial collection yet… https://t.co/iHLCFdKnOO","Stepping into Saturday night like...Victory Hand️Goodbye Blind Auditions.. hello Battles! Boxing Glove Let’s do this @thevoiceuk Oncoming Fist 8.30pm… https://t.co/Tfi5PtB5RN","RT @thevoiceuk: #TheVoiceUK Blind Auditions? Completed it mate.\n\nThe competition gets real as The Battles begin, tonight at 8.30pm on @ITV…","RT @thevoiceuk: The Blind Auditions are soooo last week! Ready for #TheVoiceUK Battles? Boxing Glove\nAhead of tomorrow's show, let's remind ourselves…","Squinting Face with TongueMicrophoneTelevision https://t.co/UWxL6KTwL4","Alarm ClockThis is your 2 hour warning folks! #TheVoiceUK is back on your Televisionat 8.30pm @itv tonight Oncoming FistMicrophone@thevoiceuk… https://t.co/qdKtSxxLI1","RT @thevoiceuk: *CLEARS THROAT* We've been nominated for the @officialntas! Collision\nPush that button and vote for us here: https://t.co/4qzHj1A9W…","Black HeartRaising HandsEyesMicrophone https://t.co/EYzbefvgSc","Thinking FaceRolling on the Floor Laughing https://t.co/popEIdOGMH","We are back! With a wicked brand new Coach @Meghan_Trainor Red Heart️\nTonight at 8:30pm @itv Microphone TelevisionEyes\nSuit by Racil Black Heart… https://t.co/Z0H9ZQtZBh","RT @thevoiceuk: The stage is set! Time to start gathering the snacks Popcorn \n\nBRAND NEW #TheVoiceUK kicks off at 8.30pm on @ITV and @WeAreSTV ht…","RT @thevoiceuk: Our shiny new #TheVoiceUK app wants YOU!\nDownload it for free to get all the goodies, including your very own play along ch…","MicrophoneRaising Hands https://t.co/UWNn53w1fW","Raising HandsCollisionMicrophoneBlack Heart https://t.co/6ReKTzMgat","RT @thevoiceuk: Is it a bird? Is it a plane? Airplane️\nNo it's our superstar Coaches, SO ready for the return of #TheVoiceUK on Saturday 4th Janua…","Happy Boxing Glove Boxing Day Boxing Glove folks! Squinting Face with Tongue If you need all the gear and a bit of an idea to kickstart your 2020, my new… https://t.co/lxGq4t040t","Raising HandsMicrophoneParty Popper https://t.co/Yhnhul4m1L","Our dynamic duo on #PantsOnFire celeb jury duty tonight is @MollieKing and @joeldommett Clapping HandsRaising Hands Get the lowdown on these… https://t.co/HnOD5jAePn","#WeWillRememberThem https://t.co/m7y6mBx3G1","Tonight at 9pm!! Loudspeaker @E4Tweets #pantsonfire https://t.co/aUquuVyFDY","RT @E4Tweets: Did @thedonnapreston and @TheVeronaRose “ace” the challenge? Find out Thursday at 9pm…  #PantsOnFire https://t.co/Iu7k51pQ2w","A lil pre #PantsonFire pucker-up with these twoKiss MarkKiss MarkSee-No-Evil Monkey! Tonight 9pm @E4Tweets @MayaJama @Kathbum Face Blowing a KissFace Blowing a Kiss https://t.co/SsccH9TIGO","We asked for it @MayaJama See-No-Evil Monkey\n#PantsOnFire Tonight.. 9pm @E4Tweets @harrietkemsley @BobbyMair https://t.co/b6PulT8L9N","Giving this weather the cold shoulder in the warmest coat of absolute dreamsVictory HandJust one of the new Winter wonders tha… https://t.co/t0TAVVDWzK","RT @C4TheCircle: We need your help to win a National Television award. Raising HandsBe a Bey and please vote for #TheCircle in the category of 'Challen…","RT @thevoicekidsuk: We've been nominated in the @officialntas!\n\nYou can support #TheVoiceKidsUK in 3 categories:\nWoman‍Microphone Best Talent Show\nMicrophone Bes…","RT @thevoiceuk: Sparkles We've been nominated in the @officialntas! Sparkles\n\nBest Talent Show: #TheVoiceUK \nBest TV Judge (or Coaches as we call them):…","Spot the wannabe on the left Squinting Face with TongueVictory Hand️\nWhen @OfficialMelB tells you to Spice Up Your Life...\nPeople of the world!… https://t.co/cP9OQy3cKd","A Circle sandwich Sandwich ft. Viewers’ Champion Tim and our 2019 @C4TheCircle winner Paddy Party Popper .. plus the whole epic gang… https://t.co/E78pY7OQdH","RT @C4TheCircle: Paddy came out at the top of the final ratings making him the WINNER of #TheCircle 2019! Confetti Ball #TheCircleFinal https://t.co/fU…","RT @C4TheCircle: Ladies and gentlemen, your Viewers' Champion! Face with Tears of Joy #TheCircle #TheCircleFinal https://t.co/JjlrLbRof6","Clapping HandsClapping HandsClapping Hands https://t.co/pJBguMtDCA","RT @C4TheCircle: \"The youngest of hearts with the wisest of brains\" - @EmmaWillis's take on Woody and Tim's friendship just broke the pozzy…","Gimme some skin @harrietkemsley  Oncoming Fist!!? Snake #PantsOnFire is back tonight at 9pm folks @E4Tweets https://t.co/QSqZQXYDkQ","Thursday 9pm.. Face Screaming in Fear!! #PantsOnFire https://t.co/TQF6Ptoqmm","RT @Channel4: Talk about an emotional rollercoaster! It's safe to say that Brooke is positively shook...\n#TheCircle https://t.co/WnYD9QRenJ","Who’s been telling porky pies then?! Thinking Face Time to find out Squinting Face with Tongue\nFire#PantsOnFireFire starts Thursday 9pm @E4Tweets https://t.co/2j4hWXhLdR","I’m live on @Channel4 until 10.30pm... don't miss it!! #TheCircle Hollow Red Circle️ https://t.co/ma5tlk1qOl","#TheCircle... let’s be havin’ ya!\n\nHollow Red Circle️ #whatyouwearinwillis Hollow Red Circle️\n\nSuit @AmandaWakeley \nShoes @YSL \n\n9:15pm on @Channel4 https://t.co/sPxExMGIeO","RT @C4TheCircle: Make sure you get our app and register to vote before tonight's live launch. There's going to be a lot of power in your ha…","RT @C4TheCircle: Star CELEBRITY CATFISH ALERT! Richard Madeley is joining the game and YOU can decide who he'll play during tonight's live lau…","RT @C4TheCircle: ALERT! It’s time to meet your Players Hollow Red Circle\n\nThe game starts Tuesday 9:15pm on @Channel4. #TheCircle https://t.co/aWPoZvX1my","So much respect for anybody who works in the NHS and during #DeliveringBabies I saw first hand the incredible work… https://t.co/p03fEQWdZW","Ad | My autumn collection has just launched and you’d better be-leaf it! Fallen Leaf Time to call in those cosy knits... have… https://t.co/IiUcHzaorV","Liar, Liar... #PantsOnFire Fire Coming soon to @E4Tweets! https://t.co/vFUbqdNK4U","RT @C4TheCircle: Police Car Light ALERT! \nWe have an official start date \n\n@EmmaWillis @Channel4 #TheCircle https://t.co/yERDNNlspc","In the game where anyone can be anyone, who would you be?! The Circle Hollow Red Circle️ Coming soon to @Channel4 \n@C4TheCircle https://t.co/7oARiq9yWy","RT @wchannel: Go back to the ward where it all began... the brand new series of @EmmaWillis: #DeliveringBabies starts tonight at 10pm! http…","RT @wchannel: \"I'm glad it still knocks me and makes me emotional because it's the most incredible thing to witness!\" #DeliveringBabies htt…","RT @thevoicekidsuk: What an EPIC Final! If you missed last night's incredible show, don't worry - you can catch up on #TheVoiceKidsUK right…","RT @nextofficial: Saturday night comfies have never looked more CHIC! Shop the NEW range from @EmmaWillis now: https://t.co/01xxgQjtuW http…","RT @thevoicekidsuk: If you missed the show on Saturday, WHAT WERE YOU DOING?! Catch up on every battle right here Musical Note \nhttps://t.co/P9jnGpMRQ…","RT @thevoicekidsuk: Welcome to @EmmaWillis' dressing room! Come on in and make yourself at home with our Backstage Reporter @AJOdudu Hugging Face #The…","RT @thevoicekidsuk: Are you ready for more Coach collaborations tonight?!\nTake it away @pixielott @jessiej @itsDannyJones @iamwill Fire #TheVo…","MicrophoneMusical NotesStudio MicrophoneIt’s The Voice, just with smaller shoes!! Tonight at 8pm on @ITVVictory Hand️#TheVoiceKidsUK https://t.co/w7dSYX3tiY","RT @thevoicekidsuk: Police Car Light This is your ONE HOUR warning Police Car Light \nBrand new #TheVoiceKidsUK is coming - get yourself ready because you won't wanna mis…","RT @thevoicekidsuk: Our Coaches have got the perfect advice on how to give your best performance - now go out there and smash it, you've go…","Just doing it for the kids! Microphone Jump on board… #TheVoiceKidsUK kicks off this Sat at 8pm on @ITV Squinting Face with TongueVictory Hand https://t.co/enps8EngBY","RT @C4TheCircle: Hollow Red Circle @EmmaWillis has joined #TheCircle https://t.co/p7TgjsxfCb","RT @wchannel: Television @EmmaWillis + the babies of #DeliveringBabies series 1 = ALL the bank holiday fuzzy feels Smiling Face with Heart-Eyes\nDon't miss our one-off special…","Summer is on the horizonCrossed Fingersas is my new summer #EmmaXDunelm bedding! Based on my fave places - Maldives, obvs Sun with Face Ibiza… https://t.co/ikPpbCQKUb","RT @marksandspencer: Wey aye man, you won’t believe who joined us for our What’s New at M&amp;S Food social series… Ant and Dec! They fire up t…","It’s so exciting that in 2019 @socceraid for @UNICEF_uk will feature ex-professional female and male players on the… https://t.co/mkXvct91Ul","Slipping into our first live semifinals Grinning Squinting Face Hello @thevoiceuk!! #TheVoiceUk #WhatYouWearinWillis \nHair -… https://t.co/roGJnTNq5f","RT @thevoiceuk: Everyone's fave #TheVoiceUK BFFs @EmmaWillis and @AJOdudu have been catching up backstage ahead of tonight's Semi Final to…","RT @GlamourMagUK: We all want a hug from @EmmaWillis! Plus Emma discusses the rise of women in TV - it's about time too! @nextofficial \nFul…","RT @comicrelief: HOW MUCH?!?!?!\n\nYou lot are the BEST Face Blowing a Kiss\n\nBut we're still a long way away from where we want to be! So please keep on giving…","It's Red Circle #RedNoseDay and we are going all night long on the BBC! If at all possible please give what you can to… https://t.co/ueEnIU7p09","RT @nextofficial: We caught up with TV star and fashionista @EmmaWillis to talk about designing her own collection for Next, featuring beac…","AD| Never in a million years did I think I’d have my own collection but @nextofficial held my hand and let me do it… https://t.co/m1bIWRypcQ","Ready for battle tonight @thevoiceuk Studio Microphone\nHair - @louisbyrnehair \nMakeup - @amandahbowen \nStylist - Leah Binnall\nTop -… https://t.co/h8ZhYLAig9","RT @thevoiceuk: 40 Singers\n3 nights of Battles\n4 Steals\n\nOnly 24 will make it through to the Knockouts - find out who is victorious tonight…","RT @marksandspencer: In the latest episode of What’s New at M&amp;S Food, we put our tasters to the test – by making them sauté their way throu…","Love love love Red Circle #RedNoseDay!! and it’s BACK so pop 15th March in your diaries. Super chuffed to be part of the… https://t.co/PfAdkLO50x","Team willis knock it out the park again. New hair, new dress and definitely a new face compared to the tired and pu… https://t.co/u314Y1jNQA","Welcome to #TeamEmma @ollyofficial https://t.co/t9OXs77TqG","RT @ollyofficial: #TheVoice @EmmaWillis casually taken her kids to school Face with Tears of JoySquinting Face with TongueWinking Face with Tongue https://t.co/6XTtJTlMl2","RT @thevoiceuk: This is your 3600 second warning Police Car LightTune into @ITV and @WeAreSTV at 8pm for brand new #TheVoiceUK! https://t.co/1jrtzSs8dI","So happy to announce I’m returning to my lovely little maternity family at Princess Alexandra Hospital Baby… https://t.co/2fjpSrvUsQ","Still lol'ing at this Face with Tears of Joy https://t.co/FR1H5mVNbT","Ready for another jam packed week ahead Raising Hands With some help from this absolute POWER of a suit from my @nextofficial e… https://t.co/EuI9SJL9jc","Prodded and preened by my fab-squad as per Red Heart️ #TheVoiceUK #WhatYouWearinWillis\nHair @louisbyrnehair \nMakeup… https://t.co/oXtqN1pIVb","RT @ollyofficial: Back at 8pm tonight @thevoiceuk Another round of blind auditions!! Smiling Face with SunglassesVictory Hand🏻#TeamOlly https://t.co/MDMdoLxON5","#TeamVoice Raising Hands The Voice UK has been nominated for Best Talent Show at the 2019 NTAs Red Heart I’d be ever so grateful if you… https://t.co/sRsnXU3RSn","RT @ITV: Get ready! The awesome foursome are BACK, baby CollisionMicrophone\n@TheVoiceUK. Starts tonight, 8pm @ITV \n#TheVoiceUK @IAMJHUD @realsirtomjones @ia…","RT @thevoiceuk: It's official: @EmmaWillis and @AJOdudu are the fortune telling duo we never knew we needed Crystal BallTwo Hearts Click the link to watch in f…","Today we belonged to #teamreindeer Sign of the Horns @laplanduk Christmas TreeSanta Claus https://t.co/8gHJ0Z2AJR","Team Willis does chicken! I couldn’t do my job without all these people. I’m incredibly lucky to work alongside thi… https://t.co/eksioKUohL","Heart...? Or bum... Thinking Face either way, it was made by the fair hands of @mattjwillis Clapping HandsSign of the Horns https://t.co/214nNsnQKF","Welcome to thevoiceuk thevoicekidsuk fam-a-lam @ajodudu reunited at last!! Woman DancingWoman DancingParty PopperParty Popper https://t.co/xeA5E97iIu","RT @marksandspencer: There was no shortage of Christmas cheer in the latest What’s New at M&amp;S Food, when our four foodies unwrapped some of…","Tonight. 9pm. ITV. Fun, games and a proper giggle with this lot... @ollyofficial, @RealSirTomJones &amp; @RochelleHumes https://t.co/oODZuM6lk8","My kind of elves... Sign of the Horns https://t.co/FYSaDCtTB3","OMG!! Holidays are comin’!!! Christmas TreeSanta Claus https://t.co/mmg8KPIZra","Don't be afraid of colour this Christmas! My @nextofficial edit is full of it, click the link to shop!  -… https://t.co/b76hQ4KQN0","Only 2 days left to get your self a limited edition #iwannabeaspicegirl T’s, sweatshirts or hoody. 100% of proceeds… https://t.co/FdHdBqtKdl","This is my excited face at spending the day with @rochellehumes Red Heart️ https://t.co/o1vkBA4NUB","It’s officially Christmas jumper season at #thevoiceuk  Woman DancingWoman DancingWoman DancingChristmas TreeChristmas TreeChristmas Tree https://t.co/vErXc1F0gc","I miss you @stephenmulhern https://t.co/chsJdOLQ5F","RT @marksandspencer: Our favourite foodie tasters are back, and this time they're joined by a very special guest, trying our new festive pa…","Tonight, the last in the series of #deliveringbabies at 10pm on @wchannel. The most remarkable 10 weeks... these ar… https://t.co/C6481QOYTn","RT @wchannel: Many hands make light work... catch the dream team at @NHSHarlow in action one last time in the series finale of @EmmaWillis:…","RT @thevoiceuk: #TheVoiceUK Coaches have formed the ULTIMATE Supergroup DrumMusical KeyboardGuitarbut something is missing... Microphone https://t.co/0NHBL6aR3D","RT @thevoiceuk: #TheVoiceUK band is back together! Make sure you watch @ITV and @WeAreSTV tonight to catch the full ad... Eyes @EmmaWillis @ia…","My little ray of sunshine is 7! He has a heart filled with kindness, love and light and he fills me with pride ever… https://t.co/xPwYKWNoFG","RT @wchannel: A healthy birth = smiles all round Hugging Face  Brand new @EmmaWillis: #DeliveringBabies continues tomorrow at 10pm. https://t.co/Q5CW2…","This little bundle of joy arrives on delivering babies tonight. Such a cutie... @wchannel at 10pm for… https://t.co/hdtiIMJ1PW","RT @wchannel: More baby bundles and delivery dramas in brand new @EmmaWillis: #DeliveringBabies tonight at 10pm BabyTwo Hearts https://t.co/qSbwVLDeFu","Hope you’re all ready for Children in Need tonight back home! If I wasn’t away, I’d be under a blanket, drinking te… https://t.co/W8Gxsek0tO","RT @wchannel: \"The thought of trying to talk to someone who has lost their child... it feels impossible.\"\n@EmmaWillis: #DeliveringBabies co…","I was incredibly lucky to meet and help look after Tara and Lloyd at PAH... they have such a gorgeous family and I… https://t.co/tyjLtWTcgb","RT @wchannel: All aboard the baby train! Your Monday night dose of emotions come courtesy of a brand new episode of @EmmaWillis: #Deliverin…","Ladies, get your coat winter is here!! Snowflake My @nextofficial winter edit launches today and I've picked some amazing p… https://t.co/b2B4k9BSls","Guess where I am Face with Tears of JoyFace with Tears of Joy about to talk #deliveringbabies with @rochellehumes and @schofe https://t.co/lwIsIgGX8C","RT @bbuk: Our wonderful host @EmmaWillis joined us earlier today for her last chat ahead of tonight's Final. It's going to be emotional - b…","RT @bbuk: The wait is almost over! Tonight, @EmmaWillis will crown the #BBUK WINNER! CrownConfetti Ball What’s been your favourite moment from the series?…","Goodbye my friend.... Red Heart️ https://t.co/22oJGOZaqL","RT @wchannel: You know the drill: pack the tissues and prepare to get broody, episode 3 of @EmmaWillis: #DeliveringBabies is tonight at 10p…","It was so cold at last nights final #bbuk eviction, a suit and over coat was very much needed thank you @gemmajonks… https://t.co/vOfXasGvpH","Not quite to the standard of @rochellehumes but I love my little pumpkins pumpkins Face with Tears of Joy🎃 Happy Halloween folks https://t.co/MES9YpdTO6","Twinning at tonight’s #unicefhalloweenball Ghost🎃 what a bloody great date night @mattjwillis Thank you as always… https://t.co/zomYStwCic","Welcoming these beautiful twins into the world, congratulations Leanne &amp; Ashley Baby Baby #DeliveringBabies is on… https://t.co/kjCAlYcawb","RT @wchannel: \"With labour, you never know which way it's going - some are long, and some are super fast!\"\nBrand new @EmmaWillis: #Deliveri…","Suit of dreams by @SextonBespoke Red Heart️for tonight’s thejonathanrossshow myself, boyzone, @CHABUDDYGEEZY and mrs.browns… https://t.co/Udl8apvCgJ","It’s officially coat weather! Wrapped up for tonight’s #bbuk eviction... Party Popper\nCoat @amandawakeley \nCamisole @mycaminyc… https://t.co/ljKWToIfMg","RT @thevoiceuk: It's your last chance to vote for #TheVoiceUK &amp; @TheVoiceKidsUK at the @OfficialNTAs! Show @ollyofficial, @RealSirTomJones,…","Haven’t done one of these since I was 10 Face with Tears of Joy next stop, a handstand  rob_solly Flexed Biceps https://t.co/obVbaaPdVM","RT @wchannel: Just in case you need more reasons to watch @EmmaWillis: #DeliveringBabies  Backhand Index Pointing RightBackhand Index Pointing RightBackhand Index Pointing Right https://t.co/iq5ZEdDERj Repeated tonight at 8…","RT @NHSHarlow: Don't forget @EmmaWillis: Delivering Babies starts tonight at 10pm on @wchannel, featuring our fantastic maternity team. Hospital A…","RT @wchannel: \"This was always my dream job - I wouldn't want to do anything else.\"\n@EmmaWillis' catch-ups with her new work BFF are making…","Ahhh Val Red Heart️ https://t.co/X1JFb9TigI","This has been possibly the most rewarding experience of my career so far! Baby I absolutely loved spending 3 months on… https://t.co/aaheDYN9H4","Beautiful day Red Heart️ #poohsticks @mrsgifletcher https://t.co/SskmxhC7qY","It's the last day to bid on the chance to attend The Voice finals live!! Victory Hand️ Come and see the amazing set, watch the… https://t.co/pmbUrrBbJ4","Whoop!!!! Christmas TreeChristmas Tree https://t.co/k7KxG6rrHu","Back with my thevoiceuk fam this week! Blind auditions are in full swing Party PopperParty Popper\nStyling for the red carpet leahbinnalls… https://t.co/iwLIlHF79Q","Thank you @jo_elvin for putting my mug on the cover of your mag and thank you @amyedits for a good old chin wag...… https://t.co/Tw8chslELv","Roaring into tonight’s 4th eviction Leopard #bbuk #whatyouwearinwillis            suit @topshop cami reiss shoes… https://t.co/O6qf894fvS","RT @wchannel: Fears, pressures and the joys of bringing new life in to the world...\n@EmmaWillis: #DeliveringBabies starts 22nd October at 1…","In support of @PrincesTrust and their newly found friendship with @eBay_UK we’re auctioning off the chance for you… https://t.co/lQ3x2XGVhk","RT @thepooluk: Megaphone TICKETS AVAILABLE Megaphone\nWe've released TEN more tickets to tomorrow's Q+A and first-look screening of @WChannel's new series D…","Suited and booted. Don’t mind if it do ! High-Heeled ShoeBlack Heart @bbuk #whatyouwearinwillis https://t.co/wfVghBfI3B","His night time routine... Not scary AT all..... Face Screaming in Fear @mattjwillis  #mudmaskmatt https://t.co/E7VpSa25Fu","Second time, in as many days, that I’ve been dressed like a banana... Never done a bleep test like this before Face with Tears of Joy to… https://t.co/Ob2L4cOMRv","Date night with @mattjwillis he loves flashing his boob to the birds Face with Tears of Joy https://t.co/l8FPshDqpi","The Willis’s have a new look... Sign of the HornsBanana https://t.co/H4oxkKejtK","Oh @kylieminogue how I love thee... What a women, what a show... Woman Dancing https://t.co/5syDOc7Ukp","Today was mostly spent laughing, with @AmandaHolden and eating my bodyweight in chocolate.. @marksandspencer know h… https://t.co/fcrzSLtAZL","I've got goosebumps already Red Heart️ @thevoiceuk https://t.co/rFLJ8AoJLW","Long lost twin... Face with Tears of JoyLeopard #fakefur #emmasedit #emmaloves #autumn18 @nextofficial https://t.co/hHCCIPGFXA","If you haven’t checked out my @nextoffcial autumn edit yet, here is a little snap shot of all the amazing bits! Lin… https://t.co/hXt4gT3Khq","Happy finale!!! Party PopperParty PopperParty PopperWoman DancingWoman DancingWoman Dancing Team #cbb https://t.co/d68F7rF2xV","My face says it all Smiling Face with Heart-Eyes  We tried the new Italian range with the lovely people at M&amp;S Food -  #MyMarksFave is the Bas… https://t.co/ysJgB0wOSy","RT @bbuk: We’ve a little surprise in store for you tonight! Face Screaming in Fear @EmmaWillis can’t wait to tell you all about it and give her thoughts on evic…","Can you believe it’s the last eviction before the #CBB FINAL Face Screaming in Fear #whatyouwearinwillis https://t.co/KQgyWEeyIH","Date night with the best squad on the planet watching @mattjwillis in #littleshopofhorrors @amandahbowen on camera… https://t.co/RCJwPK35eg","The eye of the storm continues... EyesTornadoTornadoTornado#whatyouwearinwillis #CBB https://t.co/tGKkxERZIj","RT @bbuk: That #FridayFeeling’s not gonna last for one of our housemates! Grimacing Face \nHave a listen to our amazing @emmawillis ahead of tonight’s un…","Love this... @rochellehumes leg or @PaddyMcGuinness arm? You decide @AmandaHolden Face with Tears of Joy… https://t.co/3PfwS26SNt","Eviction night people EyesTangerine#CBB #whatyouwearinwillis https://t.co/x69md2xwIx","The first @bbuk eviction Eye #CBB https://t.co/KhBmVyZXPK","RT @bbuk: Here's the lovely Emma Willis with her thoughts ahead of tonight’s live eviction. #CBB is at 9pm on @channel5_tv. Party PopperTelevision https://t.co…","Jumping into the first eviction like... rob_solly bbuk Woman Dancing https://t.co/EPUY1k9ZPs","When ‘work’ consists of hanging out with one of your favourite females on the planet Sign of the HornsI was praying for her waters… https://t.co/usPK9EgUOY","Oooo nominations tonight, tune in at 9! #CBB https://t.co/c9Vc569izN","Last nights glam Glowing Star @bbuk EyesEyesEyesEyes #eylure #CBBUK https://t.co/wy1LKAOZRQ","EyeSo happy to be back! Eye @bbuk #CBBUK https://t.co/PBJVz8xuQn","My hair colour twin.. Face with Tears of JoyGiraffe #chessingtonworldofadventures https://t.co/2fjePy2MPG","Batten down the hatches and get ready, for the Eye of the Storm is a’coming!! @bbuk returns tomorrow night on… https://t.co/hzJVcenwEG","Twice in one week rob_solly this is getting serious... Oncoming FistFlexed Biceps https://t.co/E5qhUTxRwE","Wasp attack!!! Tired Face @nextofficial nextofficialpr #winteredit #comingsoon https://t.co/Du3TEIbrSU","It’s scientifically proven, that sticking your tongue out helps you keep your balance....  Flushed Face rob_solly https://t.co/dKjKeFnIMn","Never strays far from a glitter ball this one... @mcflyharry #littleshopofhorrors https://t.co/dPSwfjmDN5","Date night with this gorgeous babe Red Heart️ @mrsgifletcher @mattjwillis #littleshopofhorrors https://t.co/0pVBfQaVrQ","Guess where I am...!!! 1 week to go.. Woman Dancing https://t.co/1eFd2wpUlp","RT @thevoicekidsuk: We're on the look for super talented solo singers and duos aged 7-14 for next year's #TheVoiceKidsUK! Magnifying Glass Tilted RightDizzyMicrophone\n\nApply here:…","Pure bliss.... #ibiza https://t.co/Z7kIag4joG","I carried a watermelon... Watermelon #holidayvibes https://t.co/LuGKLFYHav","RT @bbuk: Who will be caught in the Eye of the Storm? Eyes Tornado\n\nCelebrity Big Brother returns Thursday 16th August at 9pm on @channel5_tv. #CBB…","High VoltageTornado#CBB Eye of the Storm is comingHigh VoltageTornadoThurs 16th August 9pm @channel5_tv @bbuk Oncoming Fist https://t.co/LSzfwUUn6g","RT @bbuk: Warning️ SEVERE WEATHER WARNING! \nWe know it usually rains on Launch Night, but you’ll need more than a brolly for this storm! #CBB kic…","SparklesHow amazing were all #thevoicekidsuk Finalists tonight??MicrophoneRaising Hands Huge congrats to our unbelievably talented champion \nParty Popper… https://t.co/WJBiPLCC3L","RT @thevoicekidsuk: What an amazing series!! Thank you to all of our Kids, @itsDannyJones, @PixieLott, @iamwill and @EmmaWillis and a HUGE…","RT @kylieminogue: Tonight’s the night ...... DizzySparklesTune in to @thevoicekidsuk to see my performance of #GOLDEN!","RT @thevoicekidsuk: Give it up for #TheVoiceKidsUK Coaches and their superstar Finalists!! Clapping HandsParty PopperGlowing Star \n\n@itsDannyJones @PixieLott @iamwill https:/…","Tonight’s semi-final vibes Person Tipping Hand‍♀️Party PopperMicrophone#thevoicekidsuk #whatyouwearinwillis\nDress: Dion Lee\nShoes: @LouboutinWorld \nOne m… https://t.co/CUckpE0yuF","RT @thevoicekidsuk: Get your questions in for @EmmaWillis using the hashtag #AskEmmaWillis! Victory Hand️Microphone https://t.co/hyDxudBN12","RT @thevoicekidsuk: We're rehearsing ahead of tomorrow's Sparkles LIVE FINAL Sparkles so here's a sneak peek photo of the studio! #TheVoiceKidsUK https:/…","Spent last night with this little fire cracker... turns out, @rochellehumes  + Emma Willis = nannas at the party Winking Face https://t.co/gRXqCMPUSw","Raising HandsOncoming FistMicrophone https://t.co/3gDVqM8FEO","A storm is a’brewing…TornadoTornado #CBB is back!! See u in August @channel5_tv Squinting Face with Tongue \nHappy 18th birthday @bbuk!!!!! Party PopperBirthday Cake xx https://t.co/0ScbZdeear","RT @bbuk: Here's a very special treat to mark our 18th birthday: a first look at the BRAND NEW #CBB eye!\n \nCelebrity Big Brother: Eye of th…","Here we go... look lively folks.. Eyes in just a few minutes we have @bbuk news!! EyeParty PopperPerson Tipping Hand‍","About time eh?! @bbuk is 18 tomorrow!! Birthday CakeWrapped GiftParty Popper Got a lil something for you to celebrate... eye’ll be back Eye!! #bbuk https://t.co/L2EwJUOKfs","RT @ITV: These kids are REALLY alright! \nThe Voice Kids. Tonight 7.30pm @ITV and continues all week. @thevoicekidsuk #TheVoiceKidsUK @Pixie…","#TheVoiceKidsUK is back Oncoming Fist! 8pm @itv TONIGHT and every night for the next EIGHT nights!! MicrophoneRaising Hands  @itsdannyjones… https://t.co/w5Oo8bNvKd","RT @thevoicekidsuk: #TheVoiceKidsUK Series 2 starts TONIGHT at 8pm, and runs every night until the *LIVE* Final next Saturday. See you late…"]