["I know this is all hard for you, @realdonaldtrump, so let me spell it out: \n\n- Free testing\n- Fee waivers\n- Emergen… https://t.co/56BFt5WuDs","The honor was mine! https://t.co/syCuYzB32C","There can be no sustainable peace in Afghanistan if women are not at the negotiating table. \n\nI was honored to join… https://t.co/LrnrhbJp9r","At least 32 million nurses, caregivers, and food service workers in America don't have access to any paid sick leav… https://t.co/NYI9tvin00","My friend Amo Houghton, who passed away last week, would not want much fuss to be made about him. He would want all… https://t.co/g5H3Gw9VuR","RT @DigiDems: DigiDems is hiring 75 Political Campaign Specialists to help elect Democrats! If you are tech-savvy and ready to fight this e…","You’re not just protecting yourself by working from home, minimizing travel, and washing your hands.\n\nYou’re protec… https://t.co/80UcMD32dP","Any human being can spread the virus, whether they’re a citizen or a permanent resident or a green card applicant o… https://t.co/jAPQ6vMfmX","Three of my favorites—@aliciagarza, @aijenpoo, and @aminatou—talk on Alicia and Ai-jen's new @sunstormpod about Shi… https://t.co/84ay7Wy8ew","For 72 years, @TIME named a Man of the Year. For their 100 Women of the Year project, they chose some new faces to… https://t.co/MNNMeNuQI4","On Friday night, I got the chance to call in to #HillaryonHulu watch parties happening around the country to say hi… https://t.co/IfHzwVqhwJ","Everybody, from the president on down, needs to be focused on two things:\n\n1. How to prevent the spread of this vir… https://t.co/gqbUykV9qg","Forward movement will always produce a reaction. \n\nThose of us who believe in the equality of women and men are goi… https://t.co/wAWCQzABI6","Twenty-five years after 189 countries adopted a plan to advance women's rights at the Fourth World Conference on Wo… https://t.co/R9jT4jJnEn","RT @nowthisnews: ‘Embracing one another for our differences is something that most adults in this country can learn right now.’ — Olympic m…","RT @ClintonFdn: On this #InternationalWomensDay, we are celebrating the women in our community who inspire us all to keep fighting for equa…","On #InternationalWomensDay and every day, let’s say out loud once more that women’s rights are human rights—and no… https://t.co/idwKSrDzeb","@mr_taylor Congratulations, Mike! We're lucky to have you on the team. And thank you for registering to vote immediately. :)","RT @hulu: See for yourself. #HillaryOnHulu is now streaming, only on Hulu. https://t.co/5qJ1QHhA9u","RT @BravoWWHL: Police Car Light BREAKING: @HillaryClinton reveals her Housewives tagline Police Car Light #OneHillOfAShow #WWHL https://t.co/rt49zbN07y","When on @BravoWWHL... https://t.co/rbBp4aA8Dj","I've always said I have a life you can't make up. \n\nNow there's a docuseries on Hulu about it that also tells the s… https://t.co/apPHLn1TDr","“The joys and anguish of being Hillary Rodham Clinton” sums it up well, via a review by @hankstuever in the… https://t.co/YwLk5wl44q","You'll have to watch @FallonTonight to find out what's in the bag. https://t.co/7H5MrPr2Yx https://t.co/XFyHO1dIPQ","The title of this new book really says it all: \"Somebody's Gotta Do It: Why Cursing at the News Won't Save the Nati… https://t.co/DbsoIgds2E","Thank you to everyone who joined us for the joyful New York premiere of \"Hlilary\" last night. The docuseries about… https://t.co/5A5NZGVMQk","Voting should be easy. But as we saw with seven-hour lines in Texas on Tuesday, Republicans put up barriers to vote… https://t.co/EwiqtQEGz4","When you call anything inconvenient to you a \"hoax,\" when you undermine facts and truth, and when you rid the gover… https://t.co/0u5WxGXmxz","I talked to @GMA about \"Hillary,\" a docuseries that premieres on Hulu on Friday. It's a story not only about me but… https://t.co/uc4xEEvZ7V","I stand by this assessment. https://t.co/AcaLi3LdQG","A seven-hour wait to vote is a poll tax. \n\nWe need to restore the Voting Rights Act and stop Republican elected off… https://t.co/scOOcYP68D","I'm sending my prayers to everyone affected by last night's tornado in Nashville, especially those who lost loved ones. #IBelieveInNashville","RT @ClintonFdn: Proud to partner with organizations that are creating innovative models for disaster preparedness. @Devex highlights @centr…","RT @MeredithBlake: I talked to @HillaryClinton about her new docuseries, sexism in politics, Fleabag and why she's sounding the alarm about…","Thanks to all who brought about this lovely tribute to our North Star, @RepCummings.\nhttps://t.co/PtacmHP5q1 https://t.co/hO5LFVxoqG","Crises like the coronavirus outbreak remind us that we're truly all in this together. \n\nTake a few practical steps… https://t.co/GMf3RBe9vH","One day left to apply to #ArenaAcademy with @OnwardTogether partner @arenasummit. They’ll train you to staff a Nort… https://t.co/lFcT7wWSG1","No matter how much of a grown-up you become, you'll always be my baby. Happy birthday, @ChelseaClinton. https://t.co/uuNLWFsWFy","Love to see gutsy women flocking together. @GretaThunberg @Malala https://t.co/IiInR6kMgK","Purging public servants disloyal to a regime is banana-republic stuff. Our federal employees work for the American… https://t.co/2jkQPaYtpS","I just love this: @MMLaFleur and @UniversalStand are offering wardrobe help to women running for any elected office… https://t.co/ed5LLTc28H","North Carolinians: Take advantage of @OnwardTogether partner @ArenaSummit’s trainings next month. \n\nThey’ll prepare… https://t.co/rAUgm57ElF","Being aware of how platforms and products use our data to target us is the first step toward addressing the dark si… https://t.co/LwTmXftuRR","As a child, Katherine Johnson said she “counted everything: the steps, the dishes, the stars in the sky.\" As a math… https://t.co/1VVI3LfZxL","Putin’s Puppet is at it again, taking Russian help for himself. \n\nHe knows he can’t win without it. And we can’t le… https://t.co/YkOeqBXXMZ","RT @glamourmag: In Puerto Rico to spotlight lifesaving efforts for new mothers alongside, @HillaryClinton and @ClintonFdn are reminding us…","Advancing the rights of women and girls is the great unfinished business of the 21st century and no one has done mo… https://t.co/i9CmdDPYkD","Small islands contribute the least to climate change but often suffer the worst of its consequences. At the CGI Act… https://t.co/o6Hr4aVkCX","RT @ClintonFdn: Tune in: Day two of the @ClintonGlobal Action Network meeting starts now. Secretary @HillaryClinton will speak with leaders…","Such a terrific day visiting @ClintonFdn partners in Puerto Rico who are working on disaster resilience and recover… https://t.co/RfhMGCtm0f","RT @OpalVadhan: Good morning from Puerto Rico where @HillaryClinton visited @centromam maternal health clinic this morning, a @ClintonFdn p…","RT @brookied820: @ClintonFdn @BillClinton @HillaryClinton Can't wait!","RT @ChelseaClinton: Heartbreaking read- “Many bullies now target other children differently than they used to, with kids as young as 6 mimi…","In the last 24 hours, the American president has:\n\n1. Corruptly pressured a governor to drop lawsuits against him t… https://t.co/qBsg2HSapZ","Today, commit to #VoteforJaimeGuttenberg and an end to gun violence in America. \n\nRegister today:… https://t.co/WJze0gRHwU","Today, we remember #Parkland and the 17 people whose lives were cruelly taken at Marjory Stoneman Douglas High two… https://t.co/i45eA9ejJO","For 100 years, @LWV has empowered voters and defended democracy, and that work has rarely been more crucial than it… https://t.co/SX9P1u4UpH","Trump is using the powers of the presidency like a tyrant—now, to reward accomplices and go after witnesses who dar… https://t.co/iSTDa4sUDh","Do you realize intimidating judges is the behavior of failed-state fascists? Just asking! https://t.co/kcEzirsGUF","On the same day:\n\n- Two prosecutors have resigned from the DOJ to protest the administration’s intervention to ligh… https://t.co/H2tUnCFz0E","RT @TeamPelosi: Two days ago: \"We will not be touching your Social Security or Medicare in Fiscal Year 2021 Budget.” -Trump\n\nToday: #TrumpB…","I gave @TheEllenShow a little preview of #HillaryonHulu, the four-part docuseries premiering in March. It's the sto… https://t.co/egwA0OWo1Z","During his testimony about Trump’s crimes, Lt. Col. Vindman had a message for his father: \"You made the right decis… https://t.co/JQ5CoynmU0","The U.S. is ranked 106th out of 193 countries on @CFR_org's new Women's Power Index, which tracks where women aroun… https://t.co/uj0SR1Ewha","I happened to be booked on @TheEllenShow the day of Trump's impeachment vote. Here were my thoughts. https://t.co/vr8tSPBbZ5","If you're angry at the Republican senators who voted for a cover-up of the president's corruption, join… https://t.co/cLOxf0FGM6","As the president's impeachment trial began, Republican senators pledged an oath to defend the Constitution.\n\nToday,… https://t.co/RMnYir3Qqz","A great use of your next hour: \n\nDouble-check your voter registration and ask two friends to do the same.","Historian @alexiscoe's new book about George Washington, \"You Never Forget Your First,\" is a fresh perspective on t… https://t.co/swPU9CJjcD","One thing's for sure: There's never a dull moment on political campaigns. \n\nGet in the mix—and help beat Trump in N… https://t.co/89DEMiYXGb","It’s not just our daughters we should raise as feminists. We should raise our sons as feminists, too. I got into wh… https://t.co/qElGcAdXHi","History, made:\n\nLast night, @49ers offensive assistant coach @katiesowers became the first woman and the first open… https://t.co/y8qdx2rrZv","Congratulations to all the organizers and volunteers who have worked so hard to get out the vote in Iowa. Today is… https://t.co/kI2eTYxpTM","On Friday, Republican senators voted to help the president cover up his attempts to use America's power for his per… https://t.co/KyuFHPiCIU","With their votes to make the American president accountable to no one, Republican senators have put the interests o… https://t.co/E0dZj9U48R","Richard Nixon once made this argument: \"When the president does it, that means that it is not illegal.\" \n\nHe was fo… https://t.co/PxmXLkShzb","@FullFrontalSamB I really do.","RT @pwcdanica: I wasn’t kidding. https://t.co/pKmT6W4ZPU https://t.co/U3WBDadOEL","Love this. \n\n@StephenAtHome, @sethmeyers, @jimmykimmel, @jimmyfallon, @JKCorden, @TrevorNoah—I hope you'll take up… https://t.co/SMU7lNY8XZ","Congratulations to @AshantiGholar and @EmergeAmerica! Excited to work with you to recruit and help elect a historic… https://t.co/leHCLvqIdh","Keep calling your Republican senators: \n\n(202) 224-3121 \n\n#WeWantWitnesses https://t.co/mfW13LKb6t","Leaving Sundance having seen some terrific films, including “Siempre, Luis.” It’s the story of how @Vegalteno has c… https://t.co/JoCAKhIWh5","RT @reshmasaujani: At times, my journey with infertility left me broken. I shared today in @voguemagazine how surrogacy changed that. I fou…","RT @IndivisibleTeam: This is a game-changer and puts enormous pressure on Republican senators to allow firsthand witnesses like John Bolton…","A trial that doesn't allow testimony from material witnesses isn't a trial at all. It's a cover-up.\n\nYour Republica… https://t.co/iDirxvHYyD","Every American should watch this.\n\n#RightMattersTruthMatters https://t.co/jw1sAGn9kW","RT @ChelseaClinton: What a vile, hateful attack from @pmaner on the courageous Congresswoman @lucymcbath. \n\nIf you’re outraged by the ongoi…","Jim Lehrer was a steady voice for truth, a prolific writer, and the soul of @NewsHour. We’ll miss him. Bill and I s… https://t.co/hpwlFkumjT","Fact check:\n\nTrue. https://t.co/XkO8Hldhbc","The entire world is waiting to see whether Senate Republicans will close their eyes and cover their ears to avoid t… https://t.co/vuagFSNUI6","RT @DLCC: Today is the anniversary of the landmark Supreme Court decision #RoevWade. But don’t think for a second that Republicans aren’t p…","Momentous news in world health: \n\nThe 2 billionth lifesaving, insecticide-treated mosquito net will be distributed… https://t.co/TjTjWOeoN8","Last week, every senator swore to \"do impartial justice according to the Constitution and laws\" in the president's… https://t.co/j22y4RciZD","I thought everyone wanted my authentic, unvarnished views! \n\nBut to be serious, the number one priority for our cou… https://t.co/2YEsw1e9Uw","RT @runforsomething: BIG NEWS: It’s our 3rd anniversary!!!!!! Partying FacePartying FacePartying FacePartying Face On January 20, 2017, we launched with one goal: recruit and elect as man…","RT @fredhochberg: Over the last two years I’ve spoken with countless farmers, manufacturing workers, business leaders and politicians about…","Ten years ago today, the Supreme Court's decision in Citizens United unleashed hundreds of millions of dollars in c… https://t.co/K459RwInAT","Advancing the rights of women and girls is the great unfinished business of our time. \n\nIt's why I support… https://t.co/lNVzf8cPQP","The rules Sen. McConnell has proposed for the president's impeachment trial are the equivalent of a head juror coll… https://t.co/tcK4yFjDCb","\"Freedom is never really won. You earn it and win it in every generation.\" —Coretta Scott King #MLKDay https://t.co/XGSyK2Rv6u","Voting isn't a privilege. It's a right. And requiring voters to pay off fines and fees to exercise that right is a… https://t.co/OIrh6eDoR8","I've got the kind of life you can't make up. \n\nSee for yourself on @Hulu, March 6. https://t.co/OWUAZCEZy6",".@RunForSomething co-founders @RossMoRock and @amandalitman are right: \n\nWe can't just win the White House. Down-ba… https://t.co/Zem6VvcEZG","Listen to @Lin_Manuel, @billyeichner, @MalcolmJenkins, and @aijenpoo—and commit today to talk to new voters. It's h… https://t.co/3DCTgOaCH5","RT @runforsomething: For decades the GOP has invested millions in state elections, culminating in their control of over 60% of state legisl…","RT @TXCivilRights: Children aren't supposed to be detained by Border Patrol for more than 3 days. These children have been detained for at…","Russians appear to be re-running their 2016 hacking playbook, once again to benefit Donald Trump. \n\nWill the media… https://t.co/Yd0OsthVdK","My thoughts are with the people of Oman as they mourn the passing of Sultan Qaboos. He led his country with wisdom… https://t.co/HCiTQwXuH5","This week, the Justice Department determined that the lies that were peddled about me, my family, &amp; @ClintonFdn are… https://t.co/fknMfFFaHD","Congratulations to New York for passing automatic voter registration—a win for voters and for democracy. Let's do t… https://t.co/G2t9M95qd5","We are in a climate emergency. \nhttps://t.co/d4gpUs6JrE","Congratulations to Speaker Filler-Corn, and to Virginia! https://t.co/4FV1BbQ1wl","For @politico I wrote about my friend, Ellen Tauscher, who passed away in 2019. \n\nShe was an arms control expert, a… https://t.co/WLFf7BaW0G","I’m sending my condolences to all mourning the passing of Ralph Nesson. Ralph was a passionate advocate for familie… https://t.co/EnoWVR1OCg","#ivotedforHillaryClinton https://t.co/1nIs3QpGus","I'm thinking today of our fellow Americans affected by the earthquakes in Puerto Rico. Many families have been left… https://t.co/qJPxN3hi3m","Australia’s bushfire emergency, spurred by climate change, has killed 24 people, destroyed thousands of homes, and… https://t.co/h97sNbfFvh","Great to see @ClintonFdn’s early learning initiative, @2SmallToFail, team up with @NYSCCF to reach parents anywhere… https://t.co/QIl5LCbE8s","It’s my great privilege to become @QUBelfast's 11th—and first female—chancellor. It's a place I have great fondness… https://t.co/hivVRIqvQy","Yes, we have to win back the presidency in 2020. \n\nBut local races are just as crucial. \n\nRead this thread from the… https://t.co/4qnpyT5Ylb","There's something all of us can do to be braver, more resilient, kinder, and more grateful. This holiday season, th… https://t.co/GSRN4HSrJd","With Australia on fire and the Arctic in meltdown, it's clear we're in a climate emergency. I'm proud to support… https://t.co/R7g8s32kXK","Talked with John Lewis who’s ready to fight another battle while he continues working for all of us. Support him an… https://t.co/CfXA3eaMCq","I’m sending my prayers to the families and the community affected by last night’s horrific attack on a rabbi’s home… https://t.co/cdNizAvXuv","@KatieS @MoxxieVentures This is exciting, Katie. Congratulations—and love the name!","A merry Christmas to all, and to all a good night! https://t.co/FOcMKZM87x","RT @ClintonFdn: Headphone Hear President @BillClinton and @ChefJoseAndres discuss response and resilience after natural disasters — and the \"unbeli…","Latino political power is growing across the country, thanks to the hard work of activists and organizations around… https://t.co/LZ6xmz3F7P","No family should have to go through this. Please join me in telling @DHS_Wolf that #FamiliesBelongTogether. https://t.co/khtARyfouq","Sending warm wishes to everyone celebrating Hanukkah! Menorah https://t.co/Vu0tROLraB","Love this. \n\nFollow Madeleine's lead and apply! #AllTheHouses https://t.co/Ty6DwkRD0j",".@JohnDingell was everything that Trump is not—a true public servant and statesman in a way this president knows he… https://t.co/Ushr2ZqMdM","The president has abused his power—using his office to further not the nation's objectives but his own personal, po… https://t.co/UxTcZNnbmc","Such a pleasure to chat with #gutsywoman @JuliaGillard at @GIWLkings about the fight for a fairer, more equal world… https://t.co/Au34YKsezK","@BrianKarem https://t.co/uvA5jQ48CF","Update: Now over 1,500 and counting.\n\nhttps://t.co/HwpkJyaBdh","One of our most precious rights as Americans is the right to determine who our leaders are. \n\nThe president abused… https://t.co/Y9iKOLbMHG","More than 750 historians \"devoted to studying our nation's past,\" including Ron Chernow and Robert A. Caro, have si… https://t.co/vTr5prqPdb","RT @domesticworkers: TODAY — Activists in all 50 states will demand the impeachment and removal of Donald Trump. We're joining the movement…","I’m thrilled to say the @OnwardTogether family is growing this winter with new partners. \n\nFirst up: @TXCivilRights… https://t.co/hcjueeApcR","In America, no one is above the law.\n\nJoin @IndivisibleTeam at events around the country this Tuesday to demand you… https://t.co/GdFGJBZOzr","RT @swingleft: More than 100,000 people in Kentucky will regain the right to vote this week because KY elected a Democratic governor this N…","Don't let this horror—and the imperative to hold those responsible to account—get lost in the news. https://t.co/dJ5Uyfo6d8","The deadline to get covered by Obamacare is this Sunday, December 15. \n\nHead to https://t.co/LTQmZQt3jJ to find a p… https://t.co/IUCZidvFCF","I've done my share of interviews in my lifetime, but nothing like this. I surprised myself a few times while partic… https://t.co/kNabevpz4j","RT @JenSheltonn: \"The facts here are not in dispute. Donald Trump abused his power by putting his pure personal gain over our country...\n\nT…","Make sure your family and friends see the evidence for themselves: \n\nThe president asked a foreign power to interfe… https://t.co/Wq2Bp38nn9","When she was sworn in as Finland's new prime minister yesterday, @marinsanna became the world's youngest prime mini… https://t.co/mf76zYMAlD","I couldn't think of a better Person of the Year than @GretaThunberg. I am grateful for all she's done to raise awar… https://t.co/Ccisg9FdKV","RT @UN_Women: Today is #HumanRightsDay. In 1995, @HillaryClinton delivered this powerful speech at the the @UN Fourth World Congress on Wom…","RT @arenasummit: With the close of #ArenaAcademy Phoenix, we’ve trained almost 1,000 campaign staffers in 2019. To our Phoenix grads: we ca…","We must defend our democracy, and the painful truth is that the occupant of the Oval Office is waging war against i… https://t.co/XBPHknCBKI","RT @sternshow: You can now watch @HowardStern's FULL 5-part interview with @HillaryClinton on the #SternShow YouTube channel!\n\nVIDEO: https…","Proud to be on the inaugural episode of \"We Are Emily,\" @emilyslist's new podcast. You can listen and subscribe her… https://t.co/TF7ewdc0aZ","@Alyssa_Milano Glad you enjoyed it, Alyssa—it was good for my soul too.","By Monday, @OnwardTogether partner @arenasummit will have trained almost 1,000 new staffers for progressive campaig… https://t.co/HN65zxlXT7","RT @PaceUniversity: We've got some big news for you, #PaceU! @HillaryClinton and @ChelseaClinton are coming to our Pleasantville Campus as…","RT @emilyslist: Subscribe to our NEW PODCAST! https://t.co/BqMyrufjwf  Episode 1 drops Monday, Dec. 9th and will feature Madam Secretary @H…","RT @sternshow: .@HillaryClinton told @HowardStern she was surprised when @BarackObama asked her to serve as Secretary of State. And his exp…","In the United States of America, no one is above the law. https://t.co/DGBWf5U564","An icon turns 50. \n\nJay-Z's story is as American a tale as they come—full of poetry, hard work, and pushing for pro… https://t.co/sGO4fKeoZ7","RT @PPact: The Senate is voting TODAY on anti-abortion activist Sarah Pitlyk's nomination to the federal bench. She is extreme and unfit to…","RT @sternshow: TODAY: Former Secretary of State and 2016 presidential candidate @HillaryClinton sits down with @HowardStern for the very fi…","Every American should read the evidence for themselves in the House’s impeachment inquiry report.\n\nIt catalogues “a… https://t.co/j4drlytuec","To all the candidates, staff, and volunteers who have worked their hearts out for presidential campaigns that have… https://t.co/SWgJg6Juon","Bill and I loved seeing Tony Award-winning #gutsywoman @alistroker in the magnificent revival of @OklahomaBway in N… https://t.co/RmzrIvlaGm","RT @latinovictoryus: 26,000. \n\nThat's how many migrant children the Trump administration anticipated it would separate as part of their \"ze…","RT @ColorOfChange: Black and brown kids are the most undercounted people in the country. Our babies count -- make sure to count them on the…","The U.N. Secretary General said this week that the point of no return for the climate crisis \"is no longer over the… https://t.co/vuOSWbKgZQ","Every time a new partner joins the @OnwardTogether family, I’m reminded of how many people believe that, when we wo… https://t.co/V52Gpq4f6V","Thanks for having us, Graham! UK residents, you can catch the show here: https://t.co/PTC9Kw4XtJ https://t.co/TCOTsuKlyV","I'm in but only if I can be power forward. https://t.co/12N0tQf5MZ","Sen. Kennedy, why are you parroting Russian propaganda that U.S. intelligence officials tell us are designed to div… https://t.co/AqxJtN0tcg","No matter where we or our ancestors are from, millions of Americans will sit down together to break bread today.… https://t.co/UofQgt7HUZ","One thing I’m grateful for are vaccines that save lives. Let’s all do our part to counter anti-vaccination disinfor… https://t.co/IxuW3bMDwq","RT @CAPAction: \"Your vote is power. If you truly believe in democracy, then you should care about this issue.\"\n\nOur voting rights are under…","RT @runforsomething: We’re working with @swingleft and @arenasummit to win key state legislatures so there are better, more fair congressio…","RT @latinovictoryus: Latino Democratic Members of Congress:\n2009: 23\n2019: 37\n\n#10YearChallenge \n\nLatinos remain overwhelmingly underrepres…","Another urgent reason to take on climate change: Its impact on human health, especially the health of children. https://t.co/wTqsgAIOQu","Applications close tomorrow for the @TrainDems Staff Academy. If you or someone you know wants to work on Democrati… https://t.co/VRn1qVZe28","Glad to see this important voice join the fight to end a heartbreakingly harmful practice: \n\nThe American Medical A… https://t.co/Mnmkfdpy7Z","The reports of crackdowns on protesters, overflowing hospitals, and internet blackouts in Iran are very disturbing.… https://t.co/UdcfY4Tq6C","Occasionally. https://t.co/Y4VL8GZFoA","The question is not whether Trump has committed impeachable crimes. He has. \n\nThe question is whether Republicans i… https://t.co/rN9xGkA3e2","Congratulations to @MichelleObama for her Grammy nomination for the audiobook of \"Becoming\"! A beautiful story, wel… https://t.co/DZ9SkR0bDh","Right now, we're ceding the future at great cost to ourselves and our people but also to the great delight of our c… https://t.co/5ssaWlSZCr","RT @ClintonCenter: “When Bill was elected governor, he was passionate about trying to figure out how to create conditions for more inclusiv…","The lives of at least 22 transgender or gender non-conforming people have been lost to violence this year. Many wer… https://t.co/x5WrcxuV3I","A reminder: None of these hearings would have happened if organizers, volunteers, and voters hadn't worked together… https://t.co/aC3zXsuxvJ","Love a family of #gutsywomen. Thank you so much for joining us, Michelle and Colleen! https://t.co/ANrx0W1oDy","RT @WJCLibrary: Tomorrow, President Clinton and Secretary Clinton, together with the @ClintonFdn, will host a conference on domestic econom…","The 1990s were a period of unprecedented economic growth (h/t @BillClinton!). Tune in today to a conference Bill an… https://t.co/HDgX9gumoK","Every day Stephen Miller remains in the White House is an emergency. https://t.co/egObGuMfeX","As Transgender Awareness Week draws to a close, let’s take this moment to affirm that transgender people deserve eq… https://t.co/q0cYMj92S0","The committee to elect Democratic attorneys general has announced it will only support candidates who publicly comm… https://t.co/oeaTngB8sn","Admitting that can be gutsy in itself! Lovely talking to you. https://t.co/iGwvOMjXSn","Congratulations to Gov. @JohnBelForLa for winning a new term as governor of Louisiana—and to New Orleans and… https://t.co/MQQprtNWNM","Louisiana, it's time to geaux vote! \n\nYour next governor could have the power to veto unfair congressional maps dur… https://t.co/ttbuqYqKBQ","How do you say \"gutsy women\" in Welsh? Honored to join just a few of them—@Kirsty_Williams, @LauraMcAllister, Dean… https://t.co/ASbN58eHb3","As we mourn another school shooting and yet more tragic, needless deaths, let's resolve to act. \n\nBrian is right. D… https://t.co/6jnke9DQOv"]