["wait, see you Wednesday night I mean Drooling Face","Ok stop crying, shows over! If you missed tonight remember you can always stream #AmericanIdol on @hulu to get in o… https://t.co/6warA2nmIu","girl be careful! #AmericanIdol https://t.co/Ki9Z7W371i","cause honey is over #AmericanIdol https://t.co/TmPee9QF4m","im here with yew #AmericanIdol https://t.co/7giU5NiCd5","only OGKatycats will kno #AmericanIdol https://t.co/bVnEondc2i","lols #AmericanIdol https://t.co/9k2WikA1Bc","bet #AmericanIdol https://t.co/Iz44Zywn43","you are a meme #AmericanIdol https://t.co/3JuhZ3mrid","omg is this you or will you be in trouble tomorrow Grimacing Face #AmericanIdol https://t.co/KtVVPLJjGc","mascara! #AmericanIdol https://t.co/YEzX2PoBTI","I’m sorry but are you modeling tears #AmericanIdol https://t.co/DL613GJWG7","I know me too, I just kept thinking about the love I have for my sister too Pleading Face #AmericanIdol https://t.co/XYsDvbkwdi","exposed #AmericanIdol https://t.co/M4WboBDGty","Teeth straight, eyes full Loudly Crying Face #AmericanIdol https://t.co/nD3VTuwDhZ","exposed b. #AmericanIdol https://t.co/HN9JKnhLBt","Omg you’re so pretty tho #AmericanIdol https://t.co/4EY7w4pBd4","so cute #AmericanIdol https://t.co/XLICrbzMgG","Actually... Expressionless Face #AmericanIdol https://t.co/XweFOQVchS",". @LionelRichie said it best: tragedy can either destroy you or make you stronger and @genlinkowski channeled that… https://t.co/eBjvLeFCpa",". @IsaiahGmusic #AmericanIdol wasn’t necessarily for you, but that audition put @lukebryanonline on a journey and n… https://t.co/kPjQh722fJ","All episodes on @abc count hinny #AmericanIdol https://t.co/iN3Ftj3Jpl","A MOTTO UP FOR GRABS: BETTER LATE THAN UGLY Nail Polish🏻 #AmericanIdol","sorry not sorry #AmericanIdol https://t.co/e63Q5FpFTF","Very on brand for @LukeBryanOnline to put on his own records and serenade @LionelRichie with his own music Face with Rolling Eyes But it… https://t.co/Zg3NnaNI6a","#AmericanIdol https://t.co/Y2cEQokA7a","#ShannonGibbons just fixed our talent emergency, thank God. She just set the new standard for talent on #ShannonStandard #americanidol  Raising Hands🏼","We see A LOT of people during auditions and it ain’t always music to our ears...Face Without MouthLemon #americanidol","#JaredLettow wasn’t right for #AmericanIdol but he was the best yodeler I’ve ever seen (also the only yodeler I’ve seen) #Nodel #ricola","You got my attention with that outfit @GeenaFontanella, and you kept my attention with that song and that voice Clapping Hands🏼… https://t.co/02ONXkhvEY","WOW @GeenaFontanella is an OGGG Katy Cat, dropping Spirit West Coast like that! Face Screaming in Fear AND I’m proud of where I come fro… https://t.co/7rRaFpFGLj","If you’re struggling, there’s always someone you can talk to: \nSubstance Abuse and Mental Health Services Administr… https://t.co/Ur0SPhWa4q","Yes, music IS a friend you never lose Heart Suit️ I believe in this spiritual cowboy Folded Hands🏼Cowboy Hat Face #DillonJames #americanidol","When Dylan’s mom said, “I love him like I almost lost him” Loudly Crying FaceLoudly Crying FaceLoudly Crying Face #americanidol","Smiling Face with HornsDEVIL WORKS HARDERSmiling Face with Horns #americanidol https://t.co/UFAs9AgKTL","This segment is sponsored by @loreal Elnett Hairspray, making sure your 60’s flip does not flop during a piano duel… https://t.co/QhQY9U9IWr","That was an inspired take on “Don’t Worry, Be Happy” @singdewayne but I wanna connect with you the way your Great G… https://t.co/kdEc6Rv1sL","Is anyone else crying seeing @lionelrichie slow dance and serenade @singdewayne’s great grandma? Pleading Face #americanidol","76 years old and werkin’ 6 inch heels with a leopard dress? Great Grandma is my HERO and should meet my 99 year old… https://t.co/uyuZKVwbB1","A 1000-year-old voice in a 16-year-old body, @iamlaurenmusic delivering @pink with @leonalewis style. Put Vancouver… https://t.co/fvayp62iAp","I literally saw her sitting outside thinking she was just a fan of the show, and it turns out #CourtneyTimmons was… https://t.co/k3HeZ2kMEP","I’ll start #americanidol https://t.co/mUzy1Ntqhy","IF #AMERICANIDOL MAKES YOU OR ONE OF YOUR FAMILY MEMBERS (like my brother in law) CRY EVERY WEEK SEND ME YOUR PHOTO… https://t.co/qyd1dTb9pI","Hollywood isn’t your path right now @Ryanharmonmusic, but we think Nashville might be! We love your spirit don’t le… https://t.co/XvBGWTYl05","Well @LaurenMascitti you got all of us melting like butter 🧈 Get ready for the #AmericanIdol grind cause we’re gonn… https://t.co/ZLOK02cdGP","Anyone else mood swing like me?! Upside-Down FaceRoller Coaster #americanidol https://t.co/nLFKbTW7uz","When you unexpectedly like something and wanna keep them contestants on their toes Smiling Face with Horns Microphone#americanidol https://t.co/qol0DToRgh",".  @iamprobablyfine &amp; Leaira congratulations on your engagement! You have good taste in proposal locations or it’s… https://t.co/3NHqoHqkln","There IS a huge difference btwn a good singer and a StarSUPERSTARStar... don’t forget to be memorable #KimmyGabriella! Su… https://t.co/qA1tmfkQON","KatyCats do you make your fellow KatyCats pitch in for gas when u see me on tour? 🚙 #americanidol","Popcorn POP Popcorn on the Television - #AmericanIdol is on West Coast, and I’m live Tweeting with you Red Heart https://t.co/CPzEO9xqw1","When you go into the edit bay after happy hour Upside-Down Face Why not have a couple happy hours with us on @AmericanIdol tonight… https://t.co/0qpJTIZT1X","As a native Southern Californian, I know firsthand the devastation of wildfire across my home communities, and was… https://t.co/OEiDTssBG3","Eat your heart Red Heart out, Dorothy Basket Click your heels in colors way over the Rainbow #ShoesdayTuesday @kpcollections https://t.co/RVc60FiBbw","Me alerting the group chat about drama in real-time Selfie🏻 Tune in to #AmericanIdol NOW West Coast! https://t.co/rcO8UogBjd","Can’t believe he didn’t audition last year either I mean he was there! #AMERICANIDOL https://t.co/gOedlV6j3u","enough about me @evrenperry #AmericanIdol https://t.co/4idTQ5MdZ4","Same... (am I allowed to pick favorites too Grimacing Face) #AMERICANIDOL https://t.co/RfhIzSuMmZ","Yes, that depth! #AMERICANIDOL https://t.co/AHMZBHfJgj","k fine i’ll just go back into my cave till #kp5 #AmericanIdol https://t.co/wyHVTtzLos","Trust, Trudy, Trudeth https://t.co/Jxn00jVdvJ","i thought u liked my pure honestea https://t.co/rZb1zEl7wR","What did you think of tonight’s episode of #AmericanIdol? Let me know who your favorite was. I will RT some responses!","And if you need help, call the Substance Abuse and Mental Health Services Administration 1-800-662-HELP (4357)","Now THAT is a real partnership, @_TrebleSoul. You are such a good man, Curt. Be the rock that Hannah needs... and t… https://t.co/VJOyy0kF0F","Is...anyone...else...falling...in...love...with...@Julia_Gargano’s...voice...right...now? #AmericanIdol","FUN FACT: every Tuesday night I went to Christian Skate Night in Ventura, CA @SkatingPlus. That’s where I learned h… https://t.co/sjPUSV5P8a","Me when I accidentally run into people who say “we should get together sometime” #AmericanIdol https://t.co/ktLyKQzj8z","Well she didn’t get a golden ticket but  #ElizaCatastrophe wrote the catchiest dang song I’ve ever heard about… https://t.co/4EGbh63Cuy","I am ready for @Sarah_Isen to take us on a rollercoaster, both with her voice, and her incredible stories! Red Heart️Roller Coaster #AmericanIdol",". @ohjonnywest you’re more than just a purse-holder or “boyfriend of”… you are something special. Can’t wait for Am… https://t.co/JP1cqVaugZ","RT if you are a strong enough man to hold your girlfriend’s Handbag @ohjohnnywest #AmericanIdol","MARGIE 2.0: when I judge, I judge strictly on the talent contribution. I adore you as a human being… https://t.co/yyRyygLwnC","One of the most fun things about doing this show is that your karaoke becomes very inspired Microphone #AmericanIdol","If you’re auditioning for #AmericanIdol, what are you preparing?","Big shout out to all of our first responders around the country - thanks for risking your lives every day…and Musical Notes all… https://t.co/zixzVW0bB8","Victory Hand🏻 SECOND OF ALL, I’m used to smelling gas at the desk but it’s usually @lukebryanonline Dashing AwayNose🏼 #AmericanIdol","Index Pointing Up🏻 FIRST OF ALL, do you know how many texts I got from my mom and dad about the texts they got asking if I was okay #gasleak #AmericanIdol","Chills in my cheekbones and other magical feelings Beating Heart Thanks for that #JovinWebb #AmericanIdol @allmanbrothers https://t.co/TSsgF6Dh4F","Give me an H! Give me an O! Give me an L! Uh... this cheerleading stuff is exhausting... so just welcome to Hollywo… https://t.co/saK9fWaCpe","Introducing ATTACK OF THE CHEERLEADERS, starring me, #KyleTanguay, and @Eagles cheerleaders - NEVER COMING TO A THE… https://t.co/08TRMDy5gA","RT if you will not be held hostage in a WhatsApp groupMobile Phone#AmericanIdol","Dear @Eagles cheerleaders, I’d like to be a fly on the wall of this WhatsApp group for just a hot minute, but forew… https://t.co/HEL4styx7C","This is how I feel when I’m mentoring #AmericanIdol hopefuls (I’m Professor Higgins): https://t.co/9BUD2MkpSE","Sacrifice beauty in my face? I beg your pardon, @lukebyranonline. At least I have an option to sacrifice - you were… https://t.co/FLxeeEUIqO","I SAID THAT https://t.co/isltPEEAwl","I wasn’t sure about you #KayGenyse, but you were actually better in the streets, so you earned my voteThumbs Up🏻 Hollywood… https://t.co/ybLSjKTHAl","ok “bro” (is this #CarolineBryan?) https://t.co/tqNifMjlrN","Ladies, where do you hide stuff? #AmericanIdol","Talking to yourself in the mirror isn’t that weird a thing. Proof from right before I played the Super Bowl Person Tipping Hand🏼‍♀… https://t.co/0gXQ0we4cp","Starting the episode on a high note with #CyniahElise, whom I can’t believe is 17. I think she needs hands laid on… https://t.co/Qqbmpa5TU4","There was a prayer before #CyniahElise’s performance, and I noted @ryanseacrest’s eyes were open... RETWEET if you… https://t.co/alWYtYwR1h","OMFG!!! What an Oscar-worthy performance of Forrest Gump, @lukebryanonline! Who knew you had those acting chops? Face with Tongue… https://t.co/cpCog8k3XJ","if you don’t love me at my pixie cut then you don’t deserve me at my Goddess glow https://t.co/DJ4ip8S0Z8","For everyone checking in on me today...DON’T WORRY, I’m just falling for even more Glowing Star talent on the next episode of… https://t.co/rguJsBhC7z","this show tho Upside-Down Face https://t.co/QDhw0Vpa0V","You can pre-order @cynthialovely’s collectible vinyl today too! Heart Suit️ https://t.co/gu2pTXvNgs https://t.co/qYrUDpMRni","Having some Disappointed Faceserotonin sadsDisappointed Face during these winter months? Well this video is a burst of Sun with FacesunshineSun with Face! Check out… https://t.co/NiL8bwjlqa","It is PIT-iful that the long weekend made me almost forget about #ShoesdayTuesday! DO-nut be mad at me Weary Face… https://t.co/3sHITDZ7EZ","(NOW THAT I HAVE YOUR ATTENTION!) You’re watching @americanidol, right West Coast? There may be a quiz later. JK no… https://t.co/h7fGnUNT8l","OMG pls send pix when finished Hugging Face #AmericanIdol https://t.co/PTrZ80SPy2","Ok but is \"Swing Swing” still stuck in your head after that episode? @therejects #AmericanIdol","What’d you think of the season 3 premiere of #AmericanIdol? See you again next Sunday, same time, same place @abcnetwork Television",". @cojustsam you are safe, you are seen, and we were so happy to hear you sing. Make your grandma proud! Yellow Heart #AmericanIdol","Which team are you on? #AmericanIdol","big lol... better to get ready to cough it up cause when I win I will all of the sudden have an appetite for wagyu… https://t.co/4JsvdcWcsc","It ain’t a rose Rose but hope the golden ticket was a good consolation prize, @meghanfitton #AmericanIdol","Does anyone else think Luke and Lionel were wrong about @SaveriaMusic? #AmericanIdol",".@saveriamusic I STILL THINK THEY WERE WRONG. HOW BOUT THAT! #AmericanIdol","Honestly, this almost made me quit the show because I thought @lukebryanonline and @lionelrichie had lost their dam… https://t.co/W3utzpZ3pD","Sorry @Lipton luv u Grimacing Face #AmericanIdol https://t.co/tAkh8Akere","If you need someone to talk to, the National Suicide Prevention Lifeline is always there 1-800-273-8255","Incredible song, @louiskmusic. You are such a talented songwriter and I can’t wait to look back at this clip after… https://t.co/9lEhk5A4HI","Thank you for saving the cursing for after you left the room @alisaermo. But I wear my french fry grease with pride… https://t.co/zn4L9kJubC","When you think you look like @taylorswift13 #AmericanIdol https://t.co/hNntfsBX56","#AmericanIdol https://t.co/aNZ7Z0ghYk","“When” I run... Nail Polish🏻🇺🇸 https://t.co/2R1i4iu66t","You ARE the best, Dibesh! aka @arthurgunn122 THAT is the American dream and you can namaSTAY on #AmericanIdol Folded Hands🏻🇺🇸… https://t.co/GfsK8xDkBQ","HOW DOES HE END UP HERE? WELL, we are the only show that literally goes to the people... #AmericanIdol","Speaking of dads... Oh GEEZ, dad Face with Rolling Eyes #AmericanIdol","Tommy Bryan, do you mean #BornHereLiveHereDieHere #ad #justkiddingnotanad …also OMG I’VE NEVER SEEN WHAT YOUR DAD L… https://t.co/oHMHtQ2MHl","I’ve never seen @lionelrichie talk to anyone like that before AND I LIKE IT! Face Screaming in Fear We ain’t messing around, @nickmerico… https://t.co/P3XD51Dem5","RT IF YOU’VE EVER BEEN GHOSTED Ghost (also that look to camera is for the ones that have... CAN YOU BELIEVE...) #AmericanIdol","You can mosh but can you skank and pull your hair to the front #AmericanIdol https://t.co/aoDNZOEAAx","STOP SPREADING LIES @hunterishunting Person Gesturing No🏼‍♀️ #AmericanIdol","You’re about to see me even more unhinged Person Cartwheeling🏼‍♀ keep watching more #AmericanIdol","I don’t know why you were so nervous, #FranciscoMartin from San Fransisco... I mean I guess you were just about to… https://t.co/KodCcWVp3j","Out of thousands of people we saw I can honestly say to you we used the “you are top ten” maybe a handful of times… https://t.co/h33mSeTvYQ",".@LukeBryanOnline, life coach. #AmericanIdol https://t.co/vDyr9rYsXg","ARE YOU WATCHING THIS GREATNESS @maggierogers? Smiling Face with Heart-Eyes #AmericanIdol","Lord, if #FranciscoMartin’s heart rate was 148, what his dad’s?! #hegetsitfromhisfather 🩺Chart IncreasingFlushed Face #AmericanIdol","Fun fact: @lionelrichie and @lukebryanonline moonlight as therapy puppies (puppy breath included) when they’re not… https://t.co/ExisximmWN","#DouglasKiker that wasn’t garbage Litter in Bin Sign that was GREATNESS TrophyWeary Face Is this the fastest in a season a contestant has made us… https://t.co/b6VwZ4gnFH","Wonder if #DouglasKiker is a chiropractor on the side Thinking FaceWinking Face with TongueHeart Suit #AmericanIdol","#DouglasKiker, doing @rascalflatts justice in any key Musical Keyboard #yeahbuddy #AmericanIdol","Do you think #CamrynLeighSmith and I look alike? https://t.co/obo7mmDrFO","I’M STILL YOUNGER THAN YOU AND WILL ALWAYS BE YOUNGER THAN YOU @LUKEBRYANONLINE Girl🏼 #AmericanIdol https://t.co/qDSOV1fhYJ","Well #CamrynLeighSmith’s story is a little familiar to me… from gospel to secular Baby AngelSmiling Face with Horns but don’t worry, you’ll always… https://t.co/sp9Fp88Rtf","Oh so they’re really not gonna show us his warm-up? Always with the cliffhangers @AmericanIdol… Unamused FaceSkull","I love when these fresh off the LITERAL garbage truck singers come in with 0 experience... like don’t even know wha… https://t.co/GHC2r7AQYq","Spoiler alert: When I say “let’s see if there’s any talent left...” I am being my sarcastic self Upside-Down Face OF COURSE IT ONL… https://t.co/CTjNPFzr2B","If you don’t fit in, if you don’t see anyone out there that looks or sounds like you, if you think you’re a big fat… https://t.co/RnCtmKYmdv","Yup, Imma card holding member of the @scarypoolparty fan club too! Yes to your impact and yes to opening the flood… https://t.co/NL04SpTQvz","Since I’m kinda the mother of the American Idol house it always makes me so happy to see that our Idols do so well… https://t.co/6jLRoBATBd","#AMERICANIDOL SEASON 3 HURRR AND THEY SAY THIRD TIMES A CHARM HINNY... let’s get ready to find the next mic dropperOK Hand🏻Microphone","Pig NosePIGPig Nose things are in store for a VERY new and SyringeREVAMPEDSyringeseason of @americanidol WHICH STARTS TONIGHT 8/7c on… https://t.co/uDt2z2FZwO","one year ago I said yes to a life of love and evolution... and definitely never a dull moment Winking Face with Tongue @ Joy in Bloom https://t.co/bJqAFQ5U5A","Miss us? Even if you didn’t, we’re going to be in your living room Sunday 8/7c for the season premiere of… https://t.co/qZ7CaPyt9g","hydration n meditation hinny https://t.co/sD1x5v6Kai","Feeling Peachpeachy keen jelly beanPeach that season 3 of @americanidol is back in FOUR DAYS! Face Screaming in Fear Tune in to @jimmykimmellive… https://t.co/cWskwGJQ8Q","We're on the hunt for our next #AmericanIdol superstar!\n\nBlue Heart this Tweet to get updates from @AmericanIdol to tune-in… https://t.co/ajeed4VMtH","Are you a stripe or a solid? Good thing there’s a Melly out there for everyone Party Popper #shoesdaytuesday @kpcollections https://t.co/Gyn8MlGvNk","ROLL CALL! Index Pointing Up🏼week until the @americanidol season 3 premiere! Person Raising Hand🏼‍♀️ if you’re tuning in with me! https://t.co/J391j7u6wi","me: what’s up\n\nkatycats: WHERE’S KP5?! @ Go Sing https://t.co/2e8oOYhVNX","We all know @ryanseacrest has a thousand jobs. Did you know bus driver was one of them? BusGrimacing Face Keep an eye out for the… https://t.co/cBUOcgnpzp","Melbourne! Just ONE month until I see you at the @mcg on International Women’s Day to celebrate the best female cri… https://t.co/WcPyWyJIQX","So proud of our @unsubrecords signee @cynthialovely scoring a KICK ASS spot in the @birdsofprey movie n soundtrack:… https://t.co/0N3OVmnB2N","COME SEE @cynthialovely NEXT @moroccan_lounge 4/23 AND HOPEFULLY LEAVE OPTIMISTIC Hugging Face https://t.co/TxAXInxRE7","A love potion isn’t necessary to fall for The Phez and its sensible heel Heart Suit️ #tbt to #ShoesdayTuesday because better… https://t.co/b1Ay5ApDuR","Pleased to be appointed by HRH The Prince of Wales @clarencehouse as ambassador for @britishasiantst Children’s Pro… https://t.co/1oZJc6xq8f","do you know the hotter the fire the purer the gold is... @ Aulani Resort, Oahu, Hawaii https://t.co/hY2pKjhWDh","YOU GOT THIS Heart Suit️@JLo &amp; @shakira Heart Suit️ #PepsiHalftime","@ryanseacrest Thumbs Up🏻 @ Aulani, A Disney Resort &amp; Spa https://t.co/SfS9znDtyI","working hard or hardly working idk Person Shrugging🏼‍♀️ @ Aulani, A Disney Resort &amp; Spa https://t.co/gunCDRjbET","im gonna leave this right here ok @RyanSeacrest https://t.co/5mJsXGrtAG","LUCK-y me, it’s my year, the year of the Rat leave a comment below if you’re a rat too Person Tipping Hand🏼‍♀Winking Face with Tongue#ShoesdayTuesday… https://t.co/a5rD3MssTN","Y’all! It’s a New Year &amp; a MicrophoneNEW SEASON OF @AMERICANIDOLMicrophone Get ur Popcorn &amp; tissues Loudly Crying Face ready, we got it DIALED for season 3… https://t.co/hCIDjT9TMU","the darker the night the brighter the stars Sparkles","Sparkles #ProtectYourEnergy2020 extends from your head to your toes Sparkles #ShoesdayTuesday @katyperrycollections… https://t.co/qjwsbQkg3g","That’s sweet and all but I’m livid and flipping tables over here! https://t.co/gwWW4Yo9Wp","just saw the trailer for @BarbAndStar and finally don’t feel so alone in my sense of humor. Will be hibernating till July 31st. Victory Hand🏻","Many people wonder how the pyramids were actually built... but me, I am in constant awe and wonder of how such a lo… https://t.co/YosIX6L3SK","#FBF to a look behind my @VOGUEIndia shoot. Sustainable, colorful fashion, showcasing the beauty of Mumbai, hanging… https://t.co/Qigmo3zZ1v","nice club, kid @cynthialovely @birdsofpreywb Musical NotesDizzy https://t.co/U8wTNZxygo","It’s a new year: how about some crystals and heel-ing for 2020? Sparkles @kpcollections #ShoesdayTuesday https://t.co/Uxcc2yDRK4","Walk the walk @vogueindia Jan 2020 \n\nStory link in bio https://t.co/i5LXmjnost","Always fries with that French Fries @vogueindia Jan 2020\n\nStory link in bio https://t.co/NFhBuUbSdz","We dance to the beat of a different drum Drum @vogueindia Jan 2020\n\nStory link in bio https://t.co/LgKKlgeAaG","Fruit by the foot MangoPeachTangerine @vogueindia Jan 2020\n\nStory link in bio https://t.co/VylshJupxX","The Gateway of India - a jewel in the crown Crown 🇮🇳 @vogueindia Jan 2020\n\nStory link in bio https://t.co/gHF3u31RIk","Putting the con in confidence since 1984 Person Tipping Hand🏼‍♀ @vogueindia Jan 2020\n\nStory link in bio https://t.co/IVuGrSPY5a","Always opening up to the light Sparkles @vogueindia Jan 2020\n\nStory link in bio https://t.co/L3wLX9G5p3","gratitude is the attitude","There are two ways of spreading light: to be the candle or the mirror(ball) that reflects it @vogueindia Jan 2020 https://t.co/RGj0dCwheF","You screamt I screamt Ice Cream @vogueindia Jan 2020 https://t.co/HfbtPCQcgR","The Marigold Effect Orange Heart @vogueindia Jan 2020 https://t.co/K6FQfgFzBh","Grateful to be part of the Vogue Values cover for @vogueindia this Jan. For this shoot I got to wear many Indian de… https://t.co/SwJj4dIlp0","when you’re in bed before midnight is when you know you’re starting the new year right #2020 @ EDC Orlando 2020 https://t.co/X4WvQSZFdB","Step into the new year with style Dizzy Cheers to a wonderful 2020 (and The Frann) Clinking GlassesYellow Heart #ShoesdayTuesday @kpcollections https://t.co/fHZuQzv4uD","I know you had a #CozyLittleChristmas, but What Are You Doing New Year’s Eve? @cynthialovelyStudio Microphonehttps://t.co/LRJFVAe2tM https://t.co/Ixi6MAu9Pv","Uncut Gems ftw! So brilliant, bravo @AdamSandler Gem Stone","happy holidays with the fam Heart Suit️ https://t.co/PqThisxATr","Day 25 of 25: Merry Christmas! I hope you’ve had fun following along! Should we do another one next year? Wrapped Gift… https://t.co/WpHhI9VO6a","Day 24 of 25 Days of Cozy: Are you opening one Wrapped Gift tonight? Or are you still waiting for Santa Claus🏻? #CozyLittleChristmas… https://t.co/NbrZWysBoG","Musical NotesWrapped GiftMusical Notes https://t.co/wSKY9qOvFG","Christmas Tree https://t.co/U1Q35LtJI0","Day 23 of 25 Days of Cozy: What does Santa get? Milk, cocoa, or hot toddy? Smiling Face with HornsSanta Claus🏻 #CozyLittleChristmas… https://t.co/cUrIxAez7V","Day 22 of 25 Days of Cozy: You’ve met Pippa, Randolph, Freezy, and Eddie - now I’m opening up the curtain to show y… https://t.co/NYLYk6mew2","2020 is already so bright - not every gal gets to commemorate their trip to India with a cover of @VOGUEIndia Hugging Face Pro… https://t.co/KnTKAoOiUU","Day 21 of 25 Days of Cozy: Save a step and carry your mistletoe with you with this Instagram lens! Kiss MarkChristmas Tree… https://t.co/TLHa4knuNN"]