["HQ days 🤍Cloud with Rain https://t.co/HPLdbNr40l","RT @kylieskin: coconut body lotion tip: apply right when you get out of the shower for best results Two Hearts #kylieskin body collection is perfect…","a vision https://t.co/ASDHZQqGui","Smiling Face with Heart-Eyes https://t.co/WJb9Ec0Nzj","Mondays at Kylie HQ https://t.co/bDaiohhXCV https://t.co/owwdNPmAqY","2 hours left to get $10 off your order at https://t.co/n1uvmPB0xY and https://t.co/bDaiohhXCV Growing Heart ends at 8am pst","RT @kylieskin: We're celebrating International Women’s Day in a big way! Today we are giving you all $10 off your orders at https://t.co/Ot…","$10 off your order today at https://t.co/bDaiohhXCV and https://t.co/n1uvmPB0xY AND a portion of proceeds go to… https://t.co/aTsjJyzYcC","Plus we’re donating a portion of proceeds from all sales today to @girlsincla, an LA-based charity doing amazing th… https://t.co/j7Jtwmhq2b","Get $10 off your order today with code WOMENSDAY on https://t.co/n1uvmPB0xY and https://t.co/bDaiohhXCV #InternationalWomensDay Growing Heart","celebrating #InternationalWomensDay over on https://t.co/n1uvmPB0xY and https://t.co/bDaiohhXCV!! Growing Heart","RT @kyliecosmetics: that Pink Dreams Blush glow on @KylieJenner Black Heart https://t.co/rkT2b8JJL5 https://t.co/VcGcfBS33e","my hydrating lip mask is back in stock! Sparkles https://t.co/89BTVDUFxc Kiss Mark https://t.co/gDWRoGWEiM","my mini 🤍🤍 https://t.co/M3lNBQFQLb","I brought back my favorite Valentine's 2019, Balmain and Koko Kollection shades for my build your own palette promo… https://t.co/ukNF9vsVva","can't wait to see what palettes you guys create with my new eyeshadow singles! https://t.co/bDaiohhXCV https://t.co/DfMH7z6OyL","Build Your Own Palette starts NOW on https://t.co/bDaiohhXCV Sparkles Growing Heart 31 new single shadows and get $5 Kyliners today! Shopping Bags… https://t.co/bng5GLOj4T","wearing KYLIE lip kit and black liquid kyliner Green HeartSparkles https://t.co/bDaiohhXCV https://t.co/JgBKNAZH2b","giving you baby mama drama honey Green Heart https://t.co/kQDa7E01NK","pucci babies https://t.co/Mt0MiGTsEF","so good! https://t.co/n1uvmPB0xY https://t.co/8D7j4WYS40","RT @Lowlaaax: My skin’s never looked better! @kylieskin products are pure magic Face with Hand Over Mouth","good morning Two Hearts https://t.co/89BTVDUFxc https://t.co/lCR5exIdEr","DAY 1 Green Heart https://t.co/vSOnbv5jQ2","the best Smiling Face with Heart-Eyes https://t.co/n1uvmPB0xY https://t.co/BuY6i7URJZ","RT @kylieskin: Gotta love delivery day! Smiling Face with Hearts Coconut Body Scrub &amp; Coconut Body Lotion are both available now on https://t.co/OtVrS73XPI Two Hearts http…","i hope she wants to match w me forever 🤍🤍🤍High Voltage️ https://t.co/NNys24qWaR","what’s meant for me will always be 🤎 https://t.co/yQRsrAOB8l","RT @ehhvuhhh: Kylie’s new sunscreen that’s clear and doesn’t leave a white cast AND is SPF 40 has me like Eyes (which means i’d want to buy)","save a spot 4 me Butterfly https://t.co/1jVUmFXFGx","introducing your new best friendWeary FaceWeary FaceSmiling Face with Heart-Eyes my face sunscreen is too good i had to tease. this formula is weightless, invis… https://t.co/uQakGHGMXf","love reading your lotion reviews Smiling Face with Hearts this lotion has changed my skin forever too! Two Hearts https://t.co/n1uvmPB0xY https://t.co/WZ4UCA2RR1","girls trip 🤍 https://t.co/L5nSDRP81g https://t.co/7rBudzgQSC","🤍🤍🤍High Voltage️ https://t.co/4qzFbCHTFl","you and me ..🤍 https://t.co/kFhgidGOmS","Plus you can get a FREE Khlo$ Liquid Lipstick while supplies last! https://t.co/bDaiohhXCV Smiling Face with Hearts https://t.co/UUMcSgKPkX","Introducing Handbag Ho Lip Kit! Red Heart️ @khloekardashian’s favorite Koko Kollection liner shade now available for the fi… https://t.co/bgnxb5Qi4I","you guys loved @khloekardashian’s sold out Handbag Ho lip liner shade so much we had to bring it back as a Lip Kit!… https://t.co/1lnn5BgFqc","RT @kyliecosmetics: We’re so excited for Handbag Ho matte lip kit Smiling Face with Hearts Launching tomorrow 9am pst with a restock of True Mama Kylighter Sparkles #Kok…","RT @kyliecosmetics: Our favorite @kylieskin Coconut Body Lotion is back in stock now Smiling Face with Heart-Eyes shop on https://t.co/SmULSodZLv https://t.co/2jiAQsh…","the body lotion I can’t live without is back in stock! https://t.co/n1uvmPB0xY Two Hearts https://t.co/QTQAXgZ5qh","my favorite body lotion is restocking at 9am pst today!! https://t.co/n1uvmPB0xY Growing Heart https://t.co/uCOtVtzxcl","RT @hollietayl0r_: I’m so biased because I love Kylie but my skin has NEVER looked and felt as good as it does now, I’m absolutely in love…","Ok guys set your alarms.. my coconut body lotion will be restocked this Thursday 27th at 9am on… https://t.co/MDEnvvJ8x9","3 hours left to enter for the chance to win a year's supply of @kylieskin!! Ends at 12pm PST. Go now to enter and g… https://t.co/yfn6wry2qE","should i really Smirking FaceSmirking Face https://t.co/Yd4Mq2Nc7A","what show should i start Thinking Face","RT @jennerkarlos: Finally got new the @KylieJenner hand mirror along with the new mini set and another toner Smiling Face with Heart-Eyes @kylieskin https://t.co/lVC7…","The Stormi Palette &amp; Blush officially restocked on https://t.co/6QgyudsPC8! ButterflyHigh Voltage️ @kyliecosmetics https://t.co/TGb3yiH04d","Makeup wipes are important. Mine are all I’ve ever used since creating them. I put a bunch of yummy stuff in them s… https://t.co/5o2alBdC4i","Restock alert!! STORMI palette and blush are back in stock!! https://t.co/bDaioh0mLn Purple HeartButterfly @kyliecosmetics https://t.co/3kxNxwf0X6","RT @ItsJohnnyCyrus: anybody who knows me, knows that I’m obsessed with Kylie’s high glosses. Sparkles well one of her newest shades Stuck On You l…","Hundred Points https://t.co/kA1kPImYCz","Nauseated FaceNauseated Face https://t.co/RLO44Sd7z9","vanilla. i’m a simple girl https://t.co/rgoKafHIdL","absolutely. none for me https://t.co/axKcQvEwYL","oh yes https://t.co/00Yjeg1Cmi","all 4 baby https://t.co/s8f79BwITT","thank u ChopsticksSushi https://t.co/mta34x51ud","yumm https://t.co/8vYWndM2jn","this wisdom teeth shit is no joke. a girl just wants to eat what she wants  Weary FaceWeary FaceBaconFrench FriesHamburgerPizzaPopcorn","RT @tashAMAZING: I got my @kylieskin set! I am SO excited to try it! Beaming Face with Smiling Eyes","RT @kyliecosmetics: .@kylieskin sets are back in stock now! Growing Heart shop on https://t.co/3EKT23WmeL Sparkles #kylieskin https://t.co/Qt885ax77v","BACK IN STOCK!! Two Hearts https://t.co/n1uvmPjpGq\n\nAll of my skincare essentials in this beautiful set Smiling Face with Hearts So excited my sets… https://t.co/39bPme1fL7","my @kylieskin sets restock today at 9am pst!! https://t.co/n1uvmPjpGq Two Hearts so happy these are back! https://t.co/oC3Rf9k3AG","i’ve had enough of 2020","rest in peace pop smoke","Giving away a year's supply of @kylieskin to 10 winners! Go now to enter and good luck! Two Hearts https://t.co/WSfHK8LGpN","RT @_tmrodrigues: new @kyliecosmetics products make me happy Star-Struck https://t.co/mHoamDRw4c","RT @kylieskin: RESTOCK Collision Kylie Skin Sets restock this Thursday 2.20 9am pst on https://t.co/OtVrS73XPI Two Hearts https://t.co/7AuOSX4Q7n","RT @kyliecosmetics: Sunday Brunch kylighter &amp; Pink Dreams blush are back in stock NOW! Two Hearts Pink Dreams is a blend of Kylie’s 2 favorite blush…","my favorite new blush and highlighter combo, Pink Dreams and Sunday Brunch are back in stock!… https://t.co/8iI7dOvWH1","STORMI RESTOCK ALERT Love Letter My Stormi Mini Palette + Flutter In Love Blush will restock this Friday, Feb. 21 at 9am pst!… https://t.co/fHCgKICWzP","minis Two Hearts https://t.co/WDnGxGkLts https://t.co/phiDnCUkde","RT @khloesfav: I’m so happy right now! I finally have my Koko Kollection Pleading FaceSmiling Face with Hearts @khloekardashian @KylieJenner @kyliecosmetics https://t.co/ylbG…","RT @noshameluke: Kylie has 2 lip singles for $20, guess who’s excited Star-Struck @KylieJenner","Guys, don’t miss the last few hours of my 2 for $20 lip sale!!! https://t.co/bDaiohhXCV You get free U.S shipping w… https://t.co/evLrhLerLd","RT @RachelAF_: When @kyliecosmetics has a 2 for $20 sale, I rack up on Head Over Heels bc it’s the BEST and I wear nothing else Person Shrugging🏽‍♀️Rolling on the Floor Laughing","Last chance to shop my 2 for $20 lip singles sale!! High glosses, matte and velvet lips, Koko Kollection and more a… https://t.co/eZdapkBoew","good morning Sun️ only two hours left to get your free mirrors, wipes and headbands on https://t.co/n1uvmPB0xY Two Hearts","RT @kylieskin: FREE gift with all purchases over $40! Red Heart️ Choose between a hand mirror, headband and makeup removing wipes Cherry Blossom Shop now on htt…","I’m giving away FREE mirror, wipes and headbands on https://t.co/n1uvmPB0xY today for Valentine’s Day Two Hearts @kylieskin https://t.co/EIn2ApCTDA","happy valentine’s day!! Kiss Mark we are celebrating today on https://t.co/bDaiohhXCV with a SALE! 2 for $20 lip singles! p… https://t.co/hPVbS3hGX0","RT @TaylorCote20: @kyliecosmetics @KylieJenner velvet lipstick formula has to be one of my all time favourite liquid lipstick formulas Two Hearts Ne…","my 2 for $20 lips sale starts NOW!!! https://t.co/bDaiohhXCV Red Heart️ #ValentinesDay https://t.co/p3RjkUUtHV","it's my annual Valentine's Day sale TOMORROW!! Starting at 9am pst Friday, it's 2 for $20 on all lip singles, and f… https://t.co/Im1CgrrPTA","shop my #ValentinesDay gift guide! https://t.co/lxSbkXdbQ4","you can also shop my new travel case and minis bundle! @kylieskin https://t.co/ibIVoRNovF https://t.co/gZqxIC3UMZ","get my new minis on https://t.co/89BTVDUFxc Growing Heart https://t.co/vZaxqD1zwu","Minis Two HeartsTwo Hearts new 3 piece sets launching in one hour!! 9am pst on https://t.co/n1uvmPB0xY https://t.co/WUaaXn1HC2","NEW 3 piece mini sets are launching Tuesday Feb 11 at 9am pst Two Hearts https://t.co/DbSy7AySXK https://t.co/Wt9Zf92U4D","just launched new items from my closet! https://t.co/gY38YZCFcw https://t.co/O09gVSAY2C","have you tried my @kylieskin Coconut Body Scrub with my new loofah yet? I love how the scrub lathers up while it ex… https://t.co/QIDKCGw1xA","hey vegas Waving Hand🏼 new vending machine alert Police Car Light Two Hearts @kylieskin wanted to join! make sure you stop by Squinting Face with Tongue https://t.co/TUTXYDA7UK","RT @taraagarrett: I just bought all of @KylieJenner skin care products. So try me, it’s gonna be new skin, new me from here on out Sparkles","favorite drawer in the house Smiling Face with Hearts https://t.co/n1uvmPB0xY https://t.co/9YQX41DZRl","@irais_bravo @kyliecosmetics always free shipping over $40 on US orders and over $60 on international","who wants a #StormiCollection restock?!? I'm excited to tell you guys that we're restocking the Stormi palette and… https://t.co/Cl4cSGVwKj","just another day at the office with @harpersbazaarus ..Two Hearts https://t.co/CiuzMFt1F0","the most moisturizing @kylieskin https://t.co/n1uvmPB0xY Two Hearts https://t.co/5S8HLLMwUR","RT @harpersbazaarus: Introducing our March 2020 cover star, @KylieJenner! https://t.co/DX9gYjPKuL","HI NEW COVER Two HeartsWaving Hand🏼@harpersbazaarus https://t.co/eesc2RWtEx","https://t.co/B9qo9J7cjH","travel cases Two Hearts back in stock at https://t.co/n1uvmPB0xY  \n\nThank you for the pics @abbymariehardie @_lovelanaxo and… https://t.co/u7IbFh7uMf","RT @KimKardashian: Make Up today by @KylieJenner https://t.co/Mo244HOOl0","working on my xmas collection for this year .. any ideas guys ? Light Bulb","My travel cases just RESTOCKED! https://t.co/n1uvmPB0xY https://t.co/mAyelcmB38","#stormiworld High Voltage️🤍 https://t.co/OWu2RoMGpZ","The Stormi Collection is here Purple Heart https://t.co/bDaiohhXCV https://t.co/8NuM2091Je","RT @kimm_kardashhh: The @kylieskin eye cream is OK Hand🏼Smiling Face with Heart-Eyes","RT @robynjadestone: I am sorry but @kylieskin is the absolute oneeeee Raising Hands🏼Two HeartsThumbs Up🏽Sparkles","RT @kylieskin: All pink everything Smiling Face with Heart-Eyes #kylieskin @beautyglowgirl https://t.co/OtVrS73XPI https://t.co/6K2D0ezxqg","4 days...ButterflyPurple Heart stormi x kylie 2.1.20 \n@kyliecosmetics https://t.co/ss6UR7vRmi","at loss for words right now. praying for this beautiful family. https://t.co/tjKUYXCUgb","giving away free pencil sharpeners today with any lip purchase on https://t.co/bDaiohhXCV! Two Hearts https://t.co/u1f0jnYQKq","essentials Sparkles https://t.co/n1uvmPB0xY https://t.co/z67pVwWTII","storm’s first disney trip Check Box with Check️ButterflyHigh Voltage️ https://t.co/rnRSejM9AC","moms club https://t.co/NBlcQ3xBT0","The Stormi Collection launches 2.1.20 ButterflyCloud️ https://t.co/bDaiohhXCV @kyliecosmetics https://t.co/pNerpd1Q4D","Last day to enter to win every 2020 collection from \n@kyliecosmetics! https://t.co/SYfv0QDlTN  Two Hearts","my new lip kits and liquid lip liners just dropped at https://t.co/bDaiohhXCV! https://t.co/0AuVOQiQnv","plus I'm launching my new black and brown liquid kyliners! 9am pst tomorrow! https://t.co/bDaiohhXCV https://t.co/LvoMb0BZaS","My brand new lipstick kits launch TOMORROW Heart with Arrow https://t.co/bDaiohhXCV 9am pst https://t.co/hus8R2Agvu","New Video LIVE Black Heart https://t.co/GJVCCJjm7z","RT @kyliereligion: I’ll never get over how amazing these box designs are Smiling Face with Heart-EyesSmiling Face with Heart-EyesSmiling Face with Heart-EyesTwo HeartsTwo HeartsTwo HeartsTwo Hearts @kyliecosmetics // @KylieJenner https://t.co/Uixp2sRwut","RT @kyliecosmetics: 6 NEW lipstick kits launch tomorrow 9am pst on https://t.co/rkT2b8JJL5 Smiling Face with Heart-Eyes 6 gorgeous matte shades each come with a compl…","last few hours to shop my 2 for $25 blush, bronzer and kylighter sale on https://t.co/bDaiohhXCV Two HeartsSparkles https://t.co/esbWkFAzYv","Heart with ArrowHeart with Arrow https://t.co/47fSgRq6kZ","RT @petmykittyy: Ok I legit almost cried when @KylieJenner was revealing the Stormi collection Loudly Crying Face it’s so beautiful can not wait for its rel…","RT @Jordan_kitty99: @KylieJenner had no business playing with my heart like this, the stormi collection is too much Weary FaceButterflySparkling Heart","RT @_DreamHouse_: it’s so cute Smiling Face with Heart-EyesSmiling Face with HeartsSmiling Face with Hearts can’t wait for February @KylieJenner @kyliecosmetics https://t.co/kli7MqW2E7","RT @Nessah22787226: Give me butterflies @KylieJenner Purple Heart..the collection is everything Persevering FaceTwo Hearts https://t.co/m5FthfUdOP","Today is the last day to shop my 2 for $25 blush, bronzer and highlighter sale! https://t.co/bDaiohhXCV","RT @Johnnyygarzaa: Wow the Stormi collection is EVERYTHING Smiling Face with HeartsButterfly @KylieJenner @kyliecosmetics","RT @lilyclement_19x: I can’t get over how cuteee the new stormi collection is Pleading FaceButterfly @kyliecosmetics","RT @kyliecosmetics: 2 for $25 on all blush, bronzer and highlight happening now on https://t.co/rkT2b8JJL5 Star️ hurry, ends tomorrow 11:59pm…","RT @yetaughtni: 4:43 is the time when Stormi was born! So cute @KylieJenner https://t.co/TT7yY1u8iT","RT @jasminefield1: @KylieJenner STORMI collection  is by far the prettiest collection I’ve ever seen! Butterfly #KylieJenner #makeup @kyliecosmetics","ButterflyGrowing Heart https://t.co/W5OEw1Lukr","RT @nayeeliflores_: Ok the Stormi collection is super cute omgPleading Face @KylieJenner","My love Purple Heart go to my stories for the reveal of the Stormi Collection launching February 1st Cloud️High Voltage️ https://t.co/jTYzPnv2iB","RT @_fayyyx: Kylie really be showing out, her packaging is everythinggg Pleading FaceButterflyTwo Hearts @KylieJenner","RT @kyliecosmetics: Toasty, Winter Kissed, Pink Dreams, Pink Power, Sunday Brunch are all SOLD OUT!! Face Screaming in Fear Make sure you don’t miss out, and pi…","Shop items from my closet!! Sale on today.. https://t.co/gY38YZUg44 https://t.co/beoCh8DNWB","make sure you guys don’t miss my 2 for $25 blush, bronzer and Kylighter sale going on this weekend at… https://t.co/SurVHGId1R","my new Pink Dreams blush just sold  out! Growing Heart Sunday brunch kylighter is almost gone! Sparkles https://t.co/bDaiohhXCV","They call me Lil Kris Person Shrugging🏻‍♀️Black Heart https://t.co/j4YVjtyQX1","2 for $25 sale on ALL of my blushes, bronzers and highlighters! ends Sunday! https://t.co/bDaiohhXCV https://t.co/ebzScky7yh","Starting NOW! 2 for $25 on all of my blushes, bronzers and kylighters!! Hurry my new Pink Dreams blush and Sunday B… https://t.co/lZ9rXsyvu5","Pink Dreams blush and Sunday Brunch Kylighter... launching at 9am pst in my 2 for $25 blush, bronzer and Kylighter… https://t.co/Fi0ashW9r4","my 2 for $25 blush, bronzer and Kylighter sale starts on one hour!! 9am pst on https://t.co/bDaiohhXCV!! And the la… https://t.co/A3kurYwA4n","RT @Tori_fabiano: @kylieskin just launched new hand mirrors you know I had to bag one along with the rest of the products I needed refills…","shop my new Kylie Hand Mirror! Smiling Face with Heart-Eyes https://t.co/89BTVDUFxc https://t.co/DzaJcyh0fv","RT @KimKardashian: I’m about to shoot a get ready YouTube video right now with @KylieJenner We are answering questions so ask away! I will…","Hi Grinning Face with Big Eyes filming a YouTube with Kim tomorrow anything you want me to ask her .. or us ? Kiss MarkKiss MarkSparkles","New lip alert Mouth lipstick &amp; liner in shade “Girls Trip” launching on the 22nd on https://t.co/bDaiohhXCV https://t.co/6SeRP2XVm4","also.. I'm doing a 2 for $25 sale on all of my blush, bronzers &amp; kylighters to celebrate the 1 year anniversary! So… https://t.co/J6ujVYtxLW","So Pink Dreams blush... the reason why I made this is because I mix Baddie on the Block and Winter Kissed every sin… https://t.co/IxFMvN18Dk","Growing HeartStar️ Celebrating my blush, bronzer and Kylighter one year anniversary with these two NEW shades, launching this FRID… https://t.co/8PLOrUVl6N","my babies 🤍 thank you for all your love and support on my skincare @kylieskin.. the goal was clean, beautiful and a… https://t.co/jJBgoOBnSF","RT @ShannonCharters: But I really do Weary FaceWeary Face her shit is so good! @KylieJenner @kyliecosmetics @kylieskin https://t.co/wujOKJjUQ2","reading all of your reviews of my @KylieSkin set from this last week! This makes me so happy Two Hearts I just restocked my… https://t.co/pRuQBuOtD7","RT @kylieskin: BACK IN STOCK Growing Heart shop Kylie Skin Set now! plus a restock of the lips travel case Kiss Mark https://t.co/OtVrS73XPI https://t.co/ipL7d…","just restocked my @kylieskin sets and travel cases!! https://t.co/n1uvmPB0xY Growing HeartGrowing Heart https://t.co/AsTtRbadeI","my @kylieskin sets are restocking tomorrow! 9am pst https://t.co/n1uvmPB0xY https://t.co/4v8BPeBFyk","Giving away every single 2020 collection from @kyliecosmetics on https://t.co/bDaiohhXCV! go now to enter and good luck! Two Hearts","I'm restocking my @kylieskin sets on Monday!! 9am pst https://t.co/n1uvmPB0xY","love of my life https://t.co/GVP6qzs8BC","just launched a giveaway on https://t.co/bDaiohhXCV where you can win EVERY 2020 COLLECTION I'm launching this year… https://t.co/zz0LukjxOY","shop items from my closet now at https://t.co/T7s8H8UqJ6.. just added new pieces today! https://t.co/xmUIXOmlfM","my favorite setting powders Smiling Face with Heart-Eyes I use soft pink and translucent and these make my makeup look perfect and flawless!… https://t.co/uUe4lM027u","Shop any Kylie Skin Body product today and get a FREE body loofah with every purchase Sparkles  https://t.co/n1uvmPB0xY https://t.co/BPe2V8sYdO","RT @_trileyyy: Guys, this @kyliecosmetics set is only $25 right now at Ulta Beauty! RUN DONT WALK https://t.co/ccWvFRPXW9","RT @kyliecosmetics: Kylie Velvet Smiling Face with Heart-Eyes 25% off now with Kylie’s 2020 must have picks Sparkles hurry, last day to shop! https://t.co/rkT2b8JJL5 https:/…","giving away free @kylieskin loofahs for #NationalBubbleBathDay Person Taking Bath Only on https://t.co/DbSy7Ahhza https://t.co/upYSoEIYlm","RT @kyliecosmetics: 25% off Kylie’s must have products for 2020!! Growing Heart Shop all of Kylie’s faves for less NOW. Hurry, ends Wednesday 1/8 11:59…","RT @kyliecosmetics: Award for Best Lip Kit goes to...","RT @kyliecosmetics: Award for Best Lip Formula goes to...","my most popular lip shades! Smiling Face with Hearts https://t.co/tBnToUje94 what’s your favorite @kyliecosmetics lip shade?","my chairs match my sweater https://t.co/Mm3FjTSc3D","Yes sharpen!! Kiss Mark https://t.co/tfIsuOcP9f","coming soon.. Smiling Face️Purple HeartButterfly https://t.co/J8T4Lrg12u","get free face wipes with every order today on https://t.co/n1uvmPB0xY Face Blowing a KissTwo Hearts #HappyNewYear https://t.co/j5sfjPV0Ay","Happy New Year!! I’m giving away FREE @kylieskin makeup remover wipes today starting at 8am pst on… https://t.co/C38Ht7SzR1","just restocked my @kylieskin eye cream! https://t.co/n1uvmPjpGq Two Hearts thank you guys for the reviews.. I love reading h… https://t.co/F6IK7huIDp","just didn’t feel right going into 2020 without one last thirst trapTired FaceBlack HeartBlack Heart pic by Victoria Villarroel https://t.co/duId8nC8bV","Last chance to shop my end of year sale on https://t.co/bDaioh0mLn Police Car Light sale ends tonight at 11.59pm pst Face Blowing a Kiss","RT @SophiaAbelita: I have REALLY sensitive! My Mom got me @kylieskin face wash! My skin usually breaks out or is dry after I wash it. Not w…","My end of the year sale is on now at https://t.co/bDaioh0mLn Smiling Face with Heart-Eyes @kyliecosmetics https://t.co/CslD5NvCbU","RT @kyliecosmetics: We just restocked our high glosses for the end of year sale!! Up to 50% off at https://t.co/rkT2b8s8Tx Smiling Face with Heart-Eyes ends 12.28 at…","RT @kanyewest: https://t.co/S6LFIK5KDv https://t.co/siQxZHOXSs","my @kyliecosmetics end of year sale starts NOW! Sparkles https://t.co/bDaioh0mLn Two Hearts https://t.co/oUEOarjijS","Merry Christmas Wrapped Gift https://t.co/nX7vTqBjG9","Get ready for my @kyliecosmetics end of year sale! Police Car Light Starting tomorrow, Dec 26, at 8am pst it’s 20% off sitewide an… https://t.co/KN0rWP7My6","Merry Christmas! Christmas TreeWrapped GiftRed Heart️","Christmas Cookies with Stormi https://t.co/iWHxGsoHvo","Merry Christmas Eve! It’s the last chance to enter my signed holiday sets giveaway on Kylie Cosmetics Instagram.. G… https://t.co/8kpesRqW43","Santa’s Babies Santa Claus🏼Heart Suit️ https://t.co/NTnCRpvCgd","my KYLIE X BALMAIN palette is back in limited quantities! https://t.co/eiyPmis9aE https://t.co/9TS9bz5HXW","RT @kyliecosmetics: Candy K shadows from Candy K Kit! Growing Heart Turn any shadow into a liner! Spray your liner brush with Setting Spray and dip in…"]