["https://t.co/QtmGNhAzAh","Mexico ! Really excited to add some new shows out there, can't wait to come and play for you all. On sale Thursday… https://t.co/k5ecOXhKdi","Barcelona!! I will remember that forever. Thank you I’m fucking blown away. Better than I could have imagined. Madr… https://t.co/JZN9pnEYKo","Today is the day! Can’t wait to see you tonight Barcelona. I’ve made a tour bus playlist on @Spotify - some wildcar… https://t.co/Hczdrk9adl","Well excited to show you lot this ! Tell me your favourite memories and help build the wall https://t.co/99f2AyOhdP https://t.co/sbBNpRSjTC","Tonight's going to be incredible. Hope you're ready","@louiecuddles @wallslwts @KingLWTTour @KingLWTPromo I hope not","@KingLWTTour @KingLWTPromo This is amazing!! Minus the flowers Haha","Too fucking excited about tonight!","So fucking excited for tour!","@TheLathums @islandrecordsuk @UMG Congrats lads! Well deserved","Thanks for having me and @LighteningUK the other week @youtubemusic ! Q&amp;A is up now https://t.co/jdRlyrJPNh https://t.co/Z1FP6S8Ol7","https://t.co/Bja06Icjta","Well excited to share the #WeMadeIt Director’s Cut of my videos with you all ! Directed by @LighteningUK… https://t.co/NRbuAeDSm8","#WeMadeIt Director’s Cut. Out tomorrow @LighteningUK https://t.co/J8Z5kqleT7 https://t.co/dLR4sBGcI5","What Jadon Sancho is doing over in Germany is incredible. I don't remember being this exciting for an up and coming… https://t.co/KaGCE7YKgK","These boys smashed it at Scala and can't wait to have them on the UK and Europe tour dates. Welcome aboard lads!… https://t.co/UMU2rE7l11","@BritishGQ @NiallOfficial What are you most looking forward to about being on the apprentice?","Two weeks until we start the tour in Barcelona ! Not long now https://t.co/BIfsmLvh1V https://t.co/y8LHF9qLC1","Wow. What a performance from Tyson Fury. Incredible @Tyson_Fury","RT @LTHQOfficial: Winner winner, Tommo's gone and won a Saunders Award for Best House Party Moment! Trophyhttps://t.co/JPQ9mYDkjj @BBCR1 @jackxs…","Can't wait to get back on tour and play these new songs for you all https://t.co/S2V4BhtU92 https://t.co/FmxOX40FHB","The last #Walls track by track video is out now ! #OnlyTheBrave was the only way to close the album, so I hope you… https://t.co/yvocdx2Ymu","Playing #Defenceless live in Madrid was such a moment, it wasn't until I played it then that it became clearer to m… https://t.co/WlaYMuh3s5","Also @onlythepoetsuk fucking smashed it. Great energy","Really can't put into words what happend tonight but it was a break through moment. Thank you. Feeling very excited about what's to come","Blown away by tonight. Can't quite get my head round it. This was a special and forever memorable moment. The tour is going to be incredible","London!!! That was fucking incredible! I loved every minute of that. Thank you!! https://t.co/MsZ4OecRkK","#Fearless is all about what it means to be young, here's episode 9 of my #Walls track by track :)… https://t.co/5Jl1jtEvzn","@uanlwt Too excited. It's going to be a moment","Tonight was amazing. Looking forward to Scala now","@davidthewhiter1 I'd say its obvious. Ridiculous question to be honest","So happy to finally have #AlwaysYou out, this one was about 2 years in the making. Here's some more on it… https://t.co/4s8FyOvzNx","Chords for #Walls. Let's see what you've got https://t.co/kPVZ8btvBW","Next up is #Walls, the title track for my debut record  https://t.co/RPxcwk1PJi https://t.co/asYXukzcaT","Well excited to say I'll be playing Scarborough Open Air Theatre in August ! On sale on Friday at 9am GMT, see you… https://t.co/HPD4IonyO3","Track by track #5 for the first new song on the album #TooYoung https://t.co/VSfcDuOIPy https://t.co/IGKAoUr0Da","@davidthewhiter1 Well done last night mate!","The fourth track from my debut record is #WeMadeIt https://t.co/8NtJTHu7pP https://t.co/oxqabpqNm2","Thank you so much for all your hard work over the last week. You're all amazing.","@KingLWTPromo Amazing","@BebeRexha Thanks so much love. I see you smashing it! Hope everything is great with you x","5 years later and still the best male vocal and performance I've seen. Powerful  https://t.co/QzyxCMmYv2","@bebeslouis Bless her. Love it","@whitenjall Your support is more than enough.","@moondanceslwt @lalalouis99 Thank you","@articslouis Yeahhhh","#LTWalls","@lalalouis99 No it's perfect the way it is. Was written with the intention of leaving you wanting more","@chavvylwt Seeing the fans and seeing the reaction online","@hesthehabit At 4pm haha?","@teamworklwt Thank you!!!!","@elemsee @JeannieM28 I saw that. Amazing stuff","@KennerMarcia @AmazonMusicUK @LouisOnRadio Thank you glad you like it #walls","@shazjc Good to hear","The next track by track for Walls is out now ! https://t.co/v03ItDMMwd #DontLetItBreakYourHeart https://t.co/UzcgtjpU8g","@LouisOnRadio Unbelievable","@jdaekims I'm buzzing just had a lovely much needed lie in!","@NotYourGrandkid @stainsofblou @saintIournt @awwxnarry @GlamophonicT Sick photo","@jordangreen Get me one please lad","RT @Deezer: Check out our latest #BehindTheSong with @Louis_Tomlinson as he talks through #Walls with us! Who else is super excited to hear…","Thanks so much mate. Loads of love https://t.co/dwRurdsmiH","Basically just said you're all fucking amazing and the support has been unreal. Keep spreading the word. I'll do a story later on","And that's why I dont fuck with Instagram live","Hahahahahahaha","Hahahahahahaa this android is shiiiit. I'll put a story on later","@afterglowslouis @seriousIouis Just a really quick thank you before the signing","Be on in 5","Wanna just say a quick thanks on instagram live","Doing a track by track for each of the songs on Walls. First episode is #KillMyMind https://t.co/ctIWsEDs09 https://t.co/szFnZxaRBU","@givenawalls @wisherlwt @happilyavani Bless you. Such good people you lot!","@happilyavani If you want the truth. I dont really want to but feel the pressure from you guys. I just feel like I've outgrown it","@TeamLouisNews Incredible! Keep up the hard work :)","@yorkshivre Couldn't do it without you","@backtoyoulouis @lwtdonny Few covers, few 1D tunes and some chat","@lwtdonny @backtoyoulouis Think about 75 mins or something like that","@dearslou Haha that's pretty crazy. First photo feels like a lifetime away","@justIikechloe This is amazing. Wow","I see the hard work and the promo you all do in your cities. The dedication is on a different level","Everyone who's already bought the album , streamed it , tweeted support. You're all incredible","@artvbill @serialjp @glxtchcity @earthIouis @jadoreloueh Yeah looking at a vampire weekend cover at the moment that could be cool","@idolator Thanks for the review!!","@glxtchcity @earthIouis @jadoreloueh Actually not a bad idea. I'll look through the archive","@alwavsyou @Iouisasfook @rarewalls I really like it. Just love the others more","@jadoreloueh Always kill my mind","@WONDERVHES @serialjp I think so","@dlibyhlouis Cant wait","@rarewalls Haha fair enough","Now everyone had had a few days to listen. What's are your favourite songs? And ones you're most excited to hear live?","RT @Spotify: What's your favorite @louis_tomlinson lyric on #Walls so far? https://t.co/sfq6x7sT7K https://t.co/r9TSgpxiKD","@91shabits @wallslwts @liketobelouis @louisttpwk @LTHQOfficial This is incredible","@louscat @killmymnds Exactly!!","Anyway fuck the negativity now. It's been a siiiiick week","@mrdanwalker I'm lucky enough to have a creative outlet for me to talk about grief this doesn't however give you th… https://t.co/OiwqtqgvTL","@mrdanwalker I was upset that you continued to ask me about my grief. It goes without saying how hard it is to lose… https://t.co/qqoxLuLkip","Defo wont be going on there again Haha! Love to all my fans for always having my back","@mrdanwalker @LouisWTNews See you in about 6 hours....","@Reverend_Makers @northy_jess Haha yes lad! Sounds like a plan","Can’t wait to see you lot at these in stores and shows ! Got some Snapchat filters for you too https://t.co/39xJ9OTIEu","Just launched my new store with a load of new merch ! Get your orders in now https://t.co/09EzJQfals https://t.co/qfkPNeyqjU","27 hours later and I'm going to sleep. I'll never forget how today made me feel. Love to you all x","@steveaoki Thank you mate hopefully see you soon","Proper fucking release day. Been up for 24 hours! Thank you to all of you for making it so special.","Huge thank you to @Spotify for the billboard in Times Square ! Buzzing to finally have #Walls out there… https://t.co/EOKaE1Mk8i","This is incredible, thanks so much for this @YouTubeMusic ! All of this support has been unreal… https://t.co/yeMSnDxnqV","Blown away https://t.co/gYTntUZ9rE","Reaction to #Walls has been mad, nice one @AmazonMusicUK for the support ! https://t.co/KpkxExlekd https://t.co/siQQecbsS9","Lyric videos for each track off #Walls are also up on YouTube ! Check ‘em out https://t.co/hW9OOyPaWY https://t.co/tR8CqSHBFM","Can't quite believe I'm finally saying this. My debut album #Walls is out now! Let me know what you think… https://t.co/JTfFvF8mb1","Incredible","RT @TeamLouisNews: LOUIS HAS OFFICIALLY HIT NUMBER ONE ON ITUNES IN 30 COUNTRIES! #WALLS","@Reverend_Makers Thanks a lot. Appreciate it","RT @LOUWASMYBECAUSE: WALLS IS #1 IN 25 COUNTRIES \n#1 🇬🇧 \n#1 🇨🇿 \n#1 🇫🇮 \n#1 🇷🇴\n#1 🇳🇴\n#1 🇮🇱\n#1 🇦🇿\n#1 🇪🇪\n#1 🇸🇪 \n#1 🇺🇦\n#1 🇹🇷\n#1 🇶🇦\n#1 🇪🇬\n#1 🇬🇷…","Thank you so much for the support so far on the album. You're all incredible! Your support blows my mind.","@charitablelwt You're all incredible. Cant believe it","#walls","@givenawalls @wisherlwt Incredible","@KingLWTPromo Wow mind blowing. Love you all","#Walls is only a few hours away and I’ll be playing it live on the @TODAYshow tomorrow morning ! https://t.co/p7PLgBX7q4","#Walls is out TOMORROW https://t.co/n3HAif2lXo","@backtoyoulouis Can't believe it. That's incredible","@taejinnie16 Amazing!!","Really exciting to see Walls out in some countries already. Thank you to everyone who's supporting it","On the cover of a special fanzine of @tmrwmag ! It's over 100 pages all about my career and story so far, well exci… https://t.co/zWCGHvhq8O","Who's got their signed copy of #Walls then? https://t.co/gcNTzg9E1n","Had a good chat with @TwitterMusic about the story behind some of my tweets, was good fun this https://t.co/omjGVhwYfZ","Gonna be performing #Walls live on @FallonTonight tomorrow ! Buzzing https://t.co/x3yDtWnHV3","Proper excited to be adding more shows in Italy this summer. On sale Friday https://t.co/S2V4BhtU92 https://t.co/kRbCaMQbbW","Proper excited to add a couple of really intimate acoustic performances at @BanquetRecords and @Crash_Records next… https://t.co/XdMID2bmbZ","Thank you for all the support on Walls so far you're all amazing. Can't wait for you to hear the album","All tickets are sold out for my special show at Scala on 13th Feb as part of #BRITsWeek with @O2Music but you can d… https://t.co/HhxNDE4kOb","I’m holding an exclusive album event on the 4th February to celebrate the release of Walls ! Really excited for thi… https://t.co/oaUhD8OTuF","Thanks for all the love for the video for Walls. Defo best one I've done. Charlie smashed it!","@90lwts @wallslwts Doing vocals with Helene","@emilyeavis @GlastoFest This is amazing! Love that","Just landed back from La. Straight into the one show later on. Let's have it!","Excited to be performing on @BBCTheOneShow tomorrow. Tune in from 7pm ! https://t.co/wvNUxXKTIh","Gonna be doing some special in-store signings the week after #Walls comes out. Looking forward to seeing you all th… https://t.co/0K5ZCPxB4A","RT @LouisWTNews: #Update | In only one hour, the #WallsMusicVideo has peaked again at #4 on the Music Videos Trending Worldwide, as well at…","The video for #Walls is here ! I'm so proud of this one. Being able to go to the Moroccan desert to film this was s… https://t.co/Cv5D0aQ3Ur","Walls video premieres today at 5pm GMT ! https://t.co/jsG80irclV","#Walls video. Tomorrow https://t.co/AyCZHZz5IT","Massive thanks to @gordonsmart for doing it today. Proper nice to see you as always lad","Enjoyed today! Thanks to everyone who came to the listening party, outside the venue and thank you ALL of you for your support on Walls","Out tomorrow ! @TelegraphMag https://t.co/P40FsMnNIX","RT @Gibson_: Very proud of this song, out today! One of my favourites ever to be a wee part of. Endless thanks to @louis_tomlinson @jamieha…","Favourite lyric from #Walls ?","@lostinyourpride @louisisaIegend @louisundays @legendarylwt Hahaha what do you think?","@louisundays @legendarylwt This is more of a performance video doesn't really follow the narrative. Some references in there though","@jamiehartman Thanks for everything Jamie. Looking forward to writing some more stuff soon","Also just so you know the video for walls is defo the best one I've done!","#Walls","Hope you all like Walls. I think it's the best song I've done. Really proud of this one","RT @SpotifyUK: @thecourteeners @EllaEyre @mura_masa_ The writing's on the wall with @louistomlinson's new track #Walls Brick https://t.co/s8ISg…","My brand new single #Walls is here, this is the title track from my debut album which is only two weeks away now !… https://t.co/Dh7yfXbfsu","@SnazzyStarlight @KingLWTPromo That is absolutely fascinating. Looks amazing","@happilyavani 100%","@sunflwrvol91 Hahahahahahahhaa funny.","#Walls. Tomorrow https://t.co/7T9mSZjIzw","@holylarents @kimvantay I was surprised when he approved it. Massive respect","Friday https://t.co/cRUUMmZBEI","My chat with @brookereese is live. You can give it a watch on @applemusic @beats1 now https://t.co/u6sJ8WtpnU https://t.co/odMXSYHBCk","@LouisPromoSquad That's fucking incredible!","@hausofwallz Happy days","@loveonlt @lwt28aimh Read it again. You'll get there","@lwt28aimh ALL signed by me. Literally took 3 12 hour days. Never a print!!","@netearsleft Cant wait for this one!!","@sotomlinfuck @miguelandstiles Hahaha well spotted","@afterglowslouis Love it","@miguelandstiles Good times","@AashnaVidyarthi Dont be silly. Your support is more than enough.","@KMMTOUR Haha I actually haven't","@bbtrzl Proper excited but getting a little bit jittery","@CharlotteDpy Amazing","Who's preordered the album already??","Lots of heart in this record","Getting close to release now! Took me best part of 4 years to get here! Cant wait for you all to hear it.","Really excited to be playing a special show in support of @WarChildUK next month as part of #BRITsWeek to support t… https://t.co/md8IL6p8e5","Can't wait for you all to hear Walls ! I'm having a party this Friday in the UK where you can listen to it with me.… https://t.co/4qBXglThON","NYC ! I'll be playing a few songs and doing a signing at @RoughTradeNYC on the day Walls comes out. Purchase the al… https://t.co/piNExZCrFi","You lot work hard ! Here's the full track listing to #Walls https://t.co/SjNtpDIKX2 https://t.co/gl5wDaLuWr","Got some special filters hidden around the world on Snapchat for you. See if you can find them all... https://t.co/srTvJ6RQU7","Walls is coming https://t.co/4Rp9oE1ANB","Keep an eye out tomorrow https://t.co/4Rp9oE1ANB https://t.co/Jv8vpKjxFm","Had an amazing shoot for the next single. Cant wait for you all to see it!!","TOTY is here! Pleased to see Trent Alexander-Arnold and some of the @premierleague lads in here @EASPORTSFIFA #TOTY… https://t.co/8uCKdiwXZm","Any ideas on what happens next? #LouisTStoryboard https://t.co/Og2DwqQ5X4 https://t.co/dcy4wslqd5","@tmrwalls To see everyone","@baby_medicine A relief","@luvmyhnlzl Good how are you?","@whatsbucky Dont think it'll last","@goldenshabit @harryftirene All your support is incredible","@flickersangel @harryftirene It wasn't. I'm as confused as you all are","@harryftirene You're incredible. Thank you so much","@sadandsex @Suhana11547985 Yes thanks. Did you? Defo one of the best nights of the year","@stelloulas Patience","@callmelouver Fearless","@earthIouis @Suhana11547985 Good how are you?","@Suhana11547985 Thank you!!","Hope everyone had a good new year. Can't wait for the end of the month!!"]